[
  {
    "id": "9780132350884",
    "language": "en",
    "level": "Intermediate to advanced",
    "title": "Clean Code: A Handbook of Agile Software Craftsmanship",
    "authors": ["Robert C. Martin"],
    "pages": "464",
    "publication_date": "August 2008",
    "description": "Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship.",
    "tags": ["Software Engineering", "Clean Code", "Best Practices", "Agile"]
  },
  {
    "id": "9780201633610",
    "language": "en",
    "level": "Advanced",
    "title": "Design Patterns: Elements of Reusable Object-Oriented Software",
    "authors": ["Erich Gamma", "Richard Helm", "Ralph Johnson", "John Vlissides"],
    "pages": "416",
    "publication_date": "October 1994",
    "description": "Capturing a wealth of experience about the design of object-oriented software, four top-notch designers present a catalog of simple and succinct solutions to commonly occurring design problems. Previously undocumented, these 23 patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves.",
    "tags": ["Design Patterns", "Object-Oriented", "Software Architecture"]
  },
  {
    "id": "9780596007126",
    "language": "en",
    "level": "Beginner to intermediate",
    "title": "Head First Design Patterns",
    "authors": ["Eric Freeman", "Elisabeth Robson"],
    "pages": "694",
    "publication_date": "October 2004",
    "description": "At any given moment, someone struggles with the same software design problems you have. And, chances are, someone else has already solved your problem. This edition of Head First Design Patterns shows you the tried-and-true, road-tested patterns used by developers to create functional, elegant, reusable, and flexible software.",
    "tags": ["Design Patterns", "Java", "Learning"]
  },
  {
    "id": "9781617294549",
    "language": "en",
    "level": "Intermediate",
    "title": "Domain-Driven Design Distilled",
    "authors": ["Vaughn Vernon"],
    "pages": "176",
    "publication_date": "June 2016",
    "description": "Domain-Driven Design Distilled brings DDD to life. Whether you're a developer, architect, analyst, consultant, or customer, Vernon helps you understand exactly how DDD can help you. You'll learn the essentials of DDD: what it is, what problems it solves, how it works, and how to quickly gain value from it.",
    "tags": ["Domain-Driven Design", "DDD", "Software Architecture", "Microservices"]
  }
]
