[{"id":"9781118749913","language":"en","level":"Intermediate to advanced","title":"Windows Azure Mobile Services","authors":["Bruce Johnson"],"pages":"172","publication_date":"June 2013","description":"Get up and running with Windows Azure Mobile Services\n\nWindows Azure Mobile Services (WAMS) is a turn-key backend solution for applications, mobile or otherwise, to utilize structured storage in the cloud. It includes basic data access functionality and built-in authentication with Microsoft Account, Facebook, Twitter and Google, as well as push notification to the client app. This compact, to the point book gives you just what you need to get up and running with these tools.\n\nDemonstrates how to add, update, delete and retrieve data using standard .NET classes or REST-based requests\n\nDescribes how Windows Azure Mobile Services supports authentication of the user and looks at the mechanism used to authenticate the user\n\nFeatures a number of examples that show how the WAMS scripting capability can be used to meet real-world business needs\n\nExamines the limits of Windows Azure Mobile Services, including scalability, database integration, and redundancy options\n\nThis book shows you exactly how to take advantage of the functionality offered by Windows Azure Mobile Services.","tags":["IT Operations","Cloud Computing","Cloud Platforms","Microsoft Azure"]},{"id":"9780071496094","language":"en","level":"Intermediate to advanced","title":"MCITP SQL Server 2005 Database Administration All-in-One Exam Guide (Exams 70-431, 70-443, & 70-444)","authors":["Darril Gibson"],"pages":"752","publication_date":"October 2007","description":"All-in-One is All You Need\n\nGet complete coverage of all three Microsoft Certified IT Professional database administration exams for SQL Server 2005 in this comprehensive volume. Written by a SQL Server expert and MCITP, this definitive exam guide features learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. Detailed and authoritative, the book serves as both a complete certification study guide and an essential on-the-job reference.\n\nGet full details on all exam topics including how to:\n\nInstall and configure SQL Server 2005\nUse Transact-SQL\nManage server infrastructure design\nOptimize databases\nSecure databases and servers\nEnsure high availability\nImplement backup and recovery strategies\nMaximize the built-in administration tools\nUse Business Intelligence tools, including SSIS and SSRS\nManage concurrency\n\nElectronic content features:\n\nSix full practice exams--two for each exam: 70-431, 70-443, and 70-444\nScripts from the step-by-step exercises in the book\nVideo training clips from the author","tags":["IT Operations","Service Administration","Database Administration"]},{"id":"9780132366229","language":"en","level":"Intermediate to advanced","title":"ThinWire™ Handbook: A Guide to Creating Effective Ajax Applications","authors":["Joshua Gertzen","Ted C. Howard"],"pages":"183","publication_date":"July 2007","description":"Would you like to create powerful Ajax applications without having to be a JavaScript expert? Are you a Java developer who is looking for a better way to build rich web applications? In this book we’ll introduce you to ThinWire, an innovative open source Ajax framework that strives to empower Java developers of all skill levels. Learn how to create responsive, expressive & interactive web applications with ease. Rather than requiring you to work in the dual worlds of client & server side programming, with ThinWire you write your entire application in Java on the server-side, without writing any JavaScript, HTML or CSS. ThinWire accomplishes this feat by encapsulating the underlying client-side rendering and data communication layers, instead providing you with a clean Java component model for dealing with familiar concepts such as a buttons, trees, or grids.\n\nUse the ThinWire Handbook as a developer guide while building your ThinWire applications or just as a way to learn more about this innovative framework. Either way, the handbook provides complete coverage of all the goodies that the framework has to offer, giving you everything you need to know to build virtually any kind of Ajax web application. Whether you’re looking to tackle a small personal project or a large enterprise class project, ThinWire has the power to deliver and with the ThinWire Handbook by your side, you’ll have the know-how.","tags":["Web & Mobile","Web Development","JavaScript","Ajax"]},{"id":"9780857091147","language":"en","level":"Intermediate to advanced","title":"Tribology for Engineers","authors":["J Paulo Davim"],"pages":"320","publication_date":"January 2011","description":"Tribology for engineers discusses recent research and applications of principles of friction, wear and lubrication, and provides the fundamentals and advances in tribology for modern industry. The book examines tribology with special emphasis on surface topography, wear of materials and lubrication, and includes dedicated coverage on the fundamentals of micro and nanotribology. The book serves as a valuable reference for academics, tribology and materials researchers, mechanical, physics and materials engineers and professionals in related industries with tribology.\nEdited and written by highly knowledgeable and well-respected researchers in the field\nExamines recent research and applications of friction, wear and lubrication\nHighlights advances and future trends in the industry","tags":["IT Operations","Computer Networking","Wireless Networks","Wifi"]},{"id":"9781439848104","language":"en","level":"Intermediate to advanced","title":"Game Theory in Communication Networks","authors":["Josephina Antoniou","Andreas Pitsillides"],"pages":"156","publication_date":"August 2012","description":"Focusing on heterogeneous networks, this book addresses important resource management and security issues found in networks and uses theoretical tools to model them. Although it explores network design and management from the theoretical perspective of game theory and graph theory, the text also provides solutions for each mechanism that needs improvement by presenting a step-by-step approach. The book also includes simulation code, so practitioners can use some or all of the proposed models for better network planning. Topics covered include network selection, user-network interaction, network synthesis, and context-aware security provisioning.","tags":["IT Operations","Computer Networking","Wireless Networks"]},{"id":"0596009534","language":"en","level":"Intermediate to advanced","title":"Essential Microsoft Operations Manager","authors":["Chris Fox"],"pages":"384","publication_date":"February 2006","description":"For system administrators, ensuring that all Windows servers are performing optimally is a tall order. The larger the enterprise, the greater the chance for irritating, time-consuming configuration problems. Sometimes, you can determine the root cause of the problem yourself-but that's only if you're lucky.\n\nWith Microsoft Operations Manager (MOM), the diagnosis is done for you. MOM monitors server operations and automatically notifies you of problems by sending an immediate alert to your console, email address, or pager. To help you better understand how MOM works, O'Reilly presents Essential Microsoft Operations Manager.\n\nThe goal of this comprehensive tutorial is to give first-time MOM administrators a solid foundation for planning, implementing, and administering MOM 2005. Author Chris Fox, a renowned MOM expert, offers the type of practical, real-world advice that you need to improve the performance of your IT infrastructure.\n\nAfter taking you through the entire process of setting up MOM on the network, the book moves on to more advanced administration issues. It carefully instructs you how to program and automate MOM and the agents that reside on the servers themselves. You'll also learn how to manage the scripts that determine which server agents are relevant to report.\n\nBy capturing system data, intelligently analyzing it, and then notifying you with a suggested course of action, MOM makes extinguishing fires a breeze. And now, thanks to Essential Microsoft Operations Manager, learning how to use MOM is a breeze, too.","tags":["IT Operations","DevOps","Configuration Management","System Center Configuration Manager"]},{"id":"0738491071","language":"en","level":"Intermediate to advanced","title":"IBM Workplace Client Technology Micro Edition Version 5.7.1: Application Development and Case Study","authors":["Juan Rodriguez","Jeffrey Martin","Sidath D. Perera"],"pages":"432","publication_date":"June 2005","description":"This IBM Redbooks publication covers end-to-end pervasive solutions and provides the implementation guidelines necessary for architects and application developers. Workplace Client Technology Micro Edition (WCTME) is an integrated platform for the extension of existing enterprise applications to server-managed client devices such as desktop and mobile computers, personal digital assistants (PDAs), and other mobile and pervasive devices.\n\nThis book provides an implementation of pervasive client functions and their interaction with corresponding servers. It also includes information about the use of tools for development and deployment of an end-to-end pervasive solution, including integration considerations and application scenarios between enterprise pervasive clients, pervasive middleware and corresponding server based applications. You will find information about using tools for implementation of functions that are essential in a pervasive solution for the whole architecture such as fundamentals of programming models, capabilities provided by WCTME tooling and runtime, tooling structure and flow, wizards and code generation, platform configuration and deployment.\n\nA basic knowledge of Java programming, Java technologies and Java open standards such as OSGi is assumed.\n\nPlease note that the additional material referenced in the text is not available from IBM.","tags":["Software Development","Programming Languages","JVM Languages","Java","Spring"]},{"id":"9781119224709","language":"en","level":"Intermediate to advanced","title":"Advances in Network Clustering and Blockmodeling","authors":["Patrick Doreian","Vladimir Batagelj","Anuska Ferligoj"],"pages":"432","publication_date":"February 2020","description":"Provides an overview of the developments and advances in the field of network clustering and blockmodeling over the last 10 years\n\nThis book offers an integrated treatment of network clustering and blockmodeling, covering all of the newest approaches and methods that have been developed over the last decade. Presented in a comprehensive manner, it offers the foundations for understanding network structures and processes, and features a wide variety of new techniques addressing issues that occur during the partitioning of networks across multiple disciplines such as community detection, blockmodeling of valued networks, role assignment, and stochastic blockmodeling.\n\nWritten by a team of international experts in the field, Advances in Network Clustering and Blockmodeling offers a plethora of diverse perspectives covering topics such as: bibliometric analyses of the network clustering literature; clustering approaches to networks; label propagation for clustering; and treating missing network data before partitioning. It also examines the partitioning of signed networks, multimode networks, and linked networks. A chapter on structured networks and coarsegrained descriptions is presented, along with another on scientific coauthorship networks. The book finishes with a section covering conclusions and directions for future work. In addition, the editors provide numerous tables, figures, case studies, examples, datasets, and more.\n\nOffers a clear and insightful look at the state of the art in network clustering and blockmodeling\nProvides an excellent mix of mathematical rigor and practical application in a comprehensive manner\nPresents a suite of new methods, procedures, algorithms for partitioning networks, as well as new techniques for visualizing matrix arrays\nFeatures numerous examples throughout, enabling readers to gain a better understanding of research methods and to conduct their own research effectively\nWritten by leading contributors in the field of spatial networks analysis\n\nAdvances in Network Clustering and Blockmodeling is an ideal book for graduate and undergraduate students taking courses on network analysis or working with networks using real data. It will also benefit researchers and practitioners interested in network analysis.","tags":["IT Operations","Computer Networking"]},{"id":"9781466500525","language":"en","level":"Intermediate to advanced","title":"Industrial Wireless Sensor Networks","authors":["V. Çağrı Güngör","Gerhard P. Hancke"],"pages":"406","publication_date":"December 2017","description":"Featuring contributions by researchers around the world, this book explores the state of the art in industrial wireless sensor networks (IWSNs) and outlines future directions for research. It offers in-depth reviews of emerging and already-deployed applications and technologies, including radio and energy harvesting technologies. It also highlights technical challenges and design objectives and discusses issues critical to industrial applications, such as latency, fault tolerance, synchronization, network security, and cross-layer design. A chapter on standards emphasizes the need for specific wireless communication standards for industrial applications.","tags":["IT Operations","Computer Networking","Wireless Networks"]},{"id":"9780814420201","language":"en","level":"Beginner","title":"I Got My Dream Job and So Can You: 7 Steps to Creating Your Ideal Career After College","authors":["Pete Leibman"],"pages":"star rating fill","publication_date":"March 2012","description":"Recent graduates looking to enter the workforce face a discouraging job market and stiff competition for even the most entry-level positions.","tags":["Business","Soft Skills","Career Development","Job Seeking","Resumes & Cover Letters"]},{"id":"9781785288548","language":"en","level":"Intermediate to advanced","title":"KnockoutJS by Example","authors":["Adnan Jaswal"],"pages":"star rating fill","publication_date":"September 2015","description":"KnockoutJS by Example is your hands-on guide to building rich, interactive web applications using knockout.js, a library for implementing the Model-View-ViewModel design pattern. Through well-illustrated examples and step-by-step projects, this book empowers web developers to create modular, responsive web interfaces efficiently.\n\nWhat this Book will help me do\n\nUnderstand and implement the MVVM design pattern using knockout.js for better application structure.\nBuild dynamic and responsive web components like forms, grids, and wizards with real-world examples.\nIntegrate knockout.js with other technologies like Google Maps API, JQuery, and Bootstrap for feature-rich applications.\nSecure web applications with token-based authentication for robust user-based access control.\nDesign modular, reusable application structures by adopting industry best practices and patterns.\n\nAuthor(s)\n\nAdnan Jaswal is a seasoned web developer and an expert in modern JavaScript frameworks, including knockout.js. With years of hands-on experience building scalable web applications, Adnan's writing approach combines a developer's perspective with clear, actionable advice, making concepts accessible for learners at any stage.\n\nWho is it for?\n\nThis book is perfect for developers and designers aiming to create interactive, dynamic web applications using JavaScript. If you are familiar with essential web technologies like HTML, CSS, and JavaScript and are looking to deepen your skill set with knockout.js, this practical guide is tailored for you.","tags":["Web & Mobile","Web Development","JavaScript","Knockout.js"]},{"id":"9781788999090","language":"en","level":"Beginner","title":"Julia 1.0 Programming - Second Edition","authors":["Ivo Balbaert"],"pages":"196","publication_date":"September 2018","description":"Start your Julia programming journey with \"Julia 1.0 Programming\" by Ivo Balbaert. This book introduces you to Julia's key features and concepts, helping you leverage its high performance and productivity to create robust scientific and data applications. From setup to advanced features like macros and metaprogramming, this book covers it all.\n\nWhat this Book will help me do\n\nSet up a working Julia environment to kickstart your journey with this powerful language.\nExtend Julia's built-in type system by creating and utilizing custom types.\nEffectively visualize your data using Julia's plotting packages.\nUse built-in Julia macros for improved debugging, testing, and workflow enhancement.\nEnhance your applications by integrating Julia with other programming languages like C, Python, and MATLAB.\n\nAuthor(s)\n\nIvo Balbaert is an experienced professor and technical author specializing in programming languages and data science tools. With a focus on practical applications and clear explanations, his work aims to make complex technical topics accessible and approachable for all learners.\n\nWho is it for?\n\nThis book is ideal for statisticians, data scientists, and developers familiar with basic mathematics who are looking to adopt Julia for data-heavy and computational tasks. Beginners and intermediate programmers alike will find this book a helpful resource to quickly gain actionable Julia knowledge and apply it in their work.","tags":["Software Development","Programming Languages","Julia"]},{"id":"9781118708675","language":"en","level":"Intermediate to advanced","title":"Windows Azure Hybrid Cloud","authors":["Danny Garber","Jamal Malik","Adam Fazio"],"pages":"218","publication_date":"August 2013","description":"An essential resource for implementing and managing a cloud infrastructure in Azure\n\nServing as a critical resource for anyone responsible for strategizing, architecting, implementing or managing a cloud infrastructure, this book helps you understand what is hybrid IT and how it's applicable (and inevitable) in today's world of emerging cloud. The team of authors focus on the Microsoft concept of a private/public cloud, deploying a private cloud fabric, deploying services, and building a private cloud, as well as integrating it with Microsoft's public cloud to create a cross-premises or public cloud.\n\nLooks at why hybrid IT is important to a business and what benefits a business can expect by adopting hybrid cloud\n\nExamines a cloud management platform and discusses why it is necessary\n\nWalks you through the different kinds of solutions for IT problems that may arise\n\nPlaces a focus on considerations for ensuring resiliency, availability, and scalability when designing hybrid solutions to prevent system failure and data loss\n\nCovers optimizing the performance of the hybrid cloud as well as using tools that help you monitor and manage the performance of the hybrid cloud\n\nWindows Azure Hybrid Cloud helps you gain a better understanding of the hybrid IT environments, why those clouds should be implemented, and how they impact business.","tags":["IT Operations","Cloud Computing","Cloud Architecture","Cloud Deployment","Hybrid Cloud"]},{"id":"9780132599771","language":"en","level":"Beginner","title":"Joomla!® Explained: Your Step-by-Step Guide, Video Enhanced Edition","authors":["Stephen Burge"],"pages":"star rating fill","publication_date":"June 2011","description":"The book will show people that they can build and manage a Joomla! website without a technical background. Starting the installation, the book will detail how to add content, control users, make links and then add extra features to a Joomla! site. The book simplifies things to avoid difficult tasks that are unnecessary for beginners to understand. It is primarily a cookbook and tutorial that walks users through building a real-life website and use examples along the way.","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","Joomla"]},{"id":"9780470890806","language":"en","level":"Beginner","title":"Mastering VMware vSphere® 5","authors":["Scott Lowe"],"pages":"star rating fill","publication_date":"October 2011","description":"A new and updated edition of bestselling Mastering VMware vSphere 4\n\nWritten by leading VMware expert, this book covers all the features and capabilities of VMware vSphere. You'll learn how to install, configure, operate, manage, and secure the latest release.\n\nCovers all the new features and capabilities of the much-anticipated new release of VMware vSphere\n\nDiscusses the planning, installation, operation, and management for the latest release\n\nReviews migration to the latest vSphere software\n\nOffers hands-on instruction and clear explanations with real-world examples\n\nMastering VMware vSphere is the strategic guide you need to maximize the opportunities of virtualization.","tags":["IT Operations","Virtualization","VMware","vSphere"]},{"id":"9781492040392","language":"en","level":"Intermediate to advanced","title":"Edge Resiliency","authors":["Gary Sloper","Mark Wilkins"],"pages":"38","publication_date":"October 2018","description":"For companies that deliver services and gather data at the edge of their networks, an infrastructure resilience strategy is essential. IT departments within many medium to large enterprises today rely on third-party cloud or data center providers to help manage traffic and workloads across multicloud environments, content delivery networks (CDNs), and data centers. But those providers are also already busy managing internet issues for thousands of customers.\n\nIn this practical ebook, Gary Sloper of Oracle Dyn and Mark Wilkins of Global Knowledge explain proactive steps you can take to ensure resiliency against unplanned events at the network edge. IT directors and managers will learn how to balance workloads and optimize performance to counter volatility sources, such as internet threats, equipment failure, network congestion, and weather-related outages. The ebook also examines ways to steer traffic more efficiently and strengthen your security posture within a hybrid or multicloud environment.\n\nThis ebook will help you:\n\nRecognize the uncontrollable and unpredictable factors that contribute to internet volatility\nUnderstand the characteristics of a resilient infrastructure built to withstand volatility threats\nLearn how managed DNS infrastructure can strengthen edge resiliency performance, availability, and security\nExamine intelligent DNS-based edge services such as active failover, federated traffic steering, load balancing, and path optimization","tags":["IT Operations","DevOps","Site Reliability Engineering (SRE)"]},{"id":"9781783282036","language":"en","level":"Beginner to intermediate","title":"Instant GSON","authors":["Sandeep Patel"],"pages":"star rating fill","publication_date":"August 2013","description":"Explore the powerful features of the GSON library in this concise and practical book. \"Instant GSON\" provides a hands-on guide to efficiently handling JSON data using Google's GSON library. In this book, you'll learn essential techniques to convert Java objects to JSON and vice versa, utilize field exclusion strategies, and implement GSON in real-world applications.\n\nWhat this Book will help me do\n\nConvert Java objects into JSON format and retrieve Java objects from JSON data.\nUnderstand and work with GSON's handling of generic types and nested classes.\nLearn how to implement field exclusion strategies and write custom JSON converters.\nGain knowledge on pretty-printing JSON and utilizing versioning support.\nEffectively use GSON in various practical Java-based applications, including web projects.\n\nAuthor(s)\n\nSandeep Patel is an experienced software developer specializing in Java programming and JSON data interchange. With years of hands-on experience working with GSON, Sandeep has a deep understanding of its capabilities and nuances. His writing style is focused on practical examples and clear explanations, aimed at helping readers efficiently integrate advanced JSON management into their programming projects.\n\nWho is it for?\n\nIf you are a Java developer who is new to the GSON library and keen to incorporate it into your projects, this book is for you. \"Instant GSON\" will appeal to software developers aiming to boost productivity and master JSON data handling. Readers should have a basic understanding of Java programming and an interest in JSON serialization and deserialization. This book provides guidance tailored to beginner and intermediate skill levels.","tags":["Data","Data Engineering","Storage Formats","JSON"]},{"id":"1587052059","language":"en","level":"Intermediate to advanced","title":"Cisco Security Agent","authors":["Chad Sullivan"],"pages":"456","publication_date":"June 2005","description":"Prevent security breaches by protecting endpoint systems with Cisco Security Agent, the Cisco host Intrusion Prevention System\n\nSecure your endpoint systems with host IPS\n\nBuild and manipulate policies for the systems you wish to protect\n\nLearn how to use groups and hosts in the Cisco Security Agent architecture and how the components are related\n\nInstall local agent components on various operating systems\n\nExplore the event database on the management system to view and filter information\n\nExamine Cisco Security Agent reporting mechanisms for monitoring system activity\n\nApply Application Deployment Investigation to report on installed applications, hotfixes, and service packs\n\nCollect detailed information on processes and see how they use and are used by system resources\n\nCreate and tune policies to control your environment without impacting usability\n\nLearn how to maintain the Cisco Security Agent architecture, including administrative access roles and backups\n\nCisco Security Agent presents a detailed explanation of Cisco Security Agent, illustrating the use of host Intrusion Prevention Systems (IPS) in modern self-defending network protection schemes. At the endpoint, the deployment of a host IPS provides protection against both worms and viruses. Rather than focusing exclusively on reconnaissance phases of network attacks a host IPS approaches the problem from the other direction, preventing malicious activity on the host by focusing on behavior. By changing the focus to behavior, damaging activity can be detected and blocked–regardless of the attack.\n\nCisco Security Agent is an innovative product in that it secures the portion of corporate networks that are in the greatest need of protection–the end systems. It also has the ability to prevent a day-zero attack, which is a worm that spreads from system to system, taking advantage of vulnerabilities in networks where either the latest patches have not been installed or for which patches are not yet available. Cisco Security Agent utilizes a unique architecture that correlates behavior occurring on the end systems by monitoring clues such as file and memory access, process behavior, COM object access, and access to shared libraries as well as other important indicators.\n\nCisco Security Agent is the first book to explore the features and benefits of this powerful host IPS product. Divided into seven parts, the book provides a detailed overview of Cisco Security Agent features and deployment scenarios. Part I covers the importance of endpoint security. Part II examines the basic components of the Cisco Security Agent architecture. Part III addresses agent installation and local use. Part IV discusses the Cisco Security Agent management console’s reporting and monitoring capabilities. Part V covers advanced Cisco Security Agent analysis features. Part VI covers Cisco Security Agent policy, implementation, and management. Part VII presents additional installation and management information.\n\nWhether you are evaluating host IPS in general or looking for a detailed deployment guide for Cisco Security Agent, this book will help you lock down your endpoint systems and prevent future attacks.\n\n“While there are still a lot of ways that security can go wrong, Cisco Security Agent provides a defense even when something is wrong. I remember the email that came around from our system administrator that said, ‘There’s something attacking our web server. We’re not sure what it is, but Stormwatch is blocking it.’ That was the Nimda worm–the first of a long line of attacks stopped by Cisco Security Agent.”\n\n–Ted Doty, Product Manager, Security Technology Group, Cisco Systems®\n\nThis security book is part of the Cisco Press® Networking Technology Series. Security titles from Cisco Press help networking professionals secure critical data and resources, prevent and mitigate network attacks, and build end-to-end self-defending networks.","tags":["IT Operations","Computer Networking","Cisco"]},{"id":"9781782176244","language":"en","level":"Intermediate to advanced","title":"Microsoft System Center 2012 R2 Operations Manager Cookbook","authors":["Jonathan Horner","Chiyo Odika"],"pages":"406","publication_date":"April 2015","description":"Learn how to effectively deploy, configure, and maintain Microsoft System Center 2012 R2 Operations Manager through a comprehensive and practical approach. This book provides clear guidance and recipes to help you address the complexities of IT systems management using System Center tools.\n\nWhat this Book will help me do\n\nUnderstand the architecture and deployment processes of System Center 2012 R2 Operations Manager.\nDevelop skills in customizing configurations and creating tailored monitoring solutions.\nGain proficiency in integrating Operations Manager with other System Center components.\nLearn how to create detailed reports and dashboards for IT infrastructure insights.\nMaster techniques for system tuning and maintenance to achieve optimal performance.\n\nAuthor(s)\n\nJonathan Horner and Chiyo Odika are experienced IT professionals with extensive knowledge in the System Center suite of tools. They bring a collaborative and practical viewpoint to their writing, making technical concepts accessible to a wide range of professionals. Their real-world experience and ability to distill complex ideas ensure that this book is both informative and engaging.\n\nWho is it for?\n\nThis book is designed for IT administrators, systems engineers, and infrastructure specialists who are responsible for monitoring organizational IT systems. It is ideal for those with a basic understanding of Microsoft technologies seeking to specialize in System Center Operations Manager or improve their current deployments. Readers should aspire to enhance their capabilities in IT system monitoring and management.","tags":["IT Operations","Monitoring","System Center Operations Manager (SCOM)"]},{"id":"9781422195130","language":"en","level":"Beginner to intermediate","title":"Work Smarter with LinkedIn","authors":["Alexandra Samuel"],"pages":"66","publication_date":"June 2013","description":"If you think LinkedIn is just for job hunting, you’re missing out on the many ways you can take advantage of this social network to build the professional relationships you need to advance in your career. LinkedIn can help you initiate, strengthen, and use the very real human connections that make you effective on the joband help you get ahead. This short, practical book shows you how.In Work Smarter with LinkedIn, social media expert Alexandra Samuel demonstrates the most effective ways to actively build and use your network, sharing tips and tricks on: Deciding which connection invitations to accept Searching for potential connections when you need to establish a new contact Using business travel to make the most of face time with colleagues and contacts Capturing all the connections you’ve made at a conference When not to use LinkedInThe book also includes a 30-minute quick guide to startingor perfectingyour LinkedIn profile.Interested in learning more about how social media can help you get ahead of your daily workand get ahead in your career? Look for more in this series of short, digital books from Harvard Business Review Press and social media expert Alexandra Samuel. Other installments provide the best tips and tricks for using tools like Evernote, Twitter, HootSuite, and Gmail to get organized and improve your performance on the job.","tags":["Business","Soft Skills","Career Development","Job Seeking","LinkedIn Job Searching"]},{"id":"9781597490184","language":"en","level":"Intermediate to advanced","title":"Host Integrity Monitoring Using Osiris and Samhain","authors":["Brian Wotring"],"pages":"450","publication_date":"July 2005","description":"This book will walk the reader through the process of preparing and deploying open source host integrity monitoring software, specifically, Osiris and Samhain. From the configuration and installation to maintenance, testing, and fine-tuning, this book will cover everything needed to correctly deploy a centralized host integrity monitoring solution. The domain includes home networks on up to large-scale enterprise environments.Throughout the book, realistic and practical configurations will be provided for common server and desktop platforms. By the end of the book, the reader will not only understand the strengths and limitations of host integrity tools, but also understand how to effectively make use of them in order to integrate them into a security policy.* Brian Wotring is the creator of Osiris. He speaks and writes frequently on Osiris for major magazines, Web sites, and trade shows. And, the book can be prominently marketed from the Osiris Web site* This is the first book published on host integrity monitoring, despite the widespread deployment of Osiris and Samhain* Host Integrity Monitoring is the only way to accurately determine if a malicious attacker has successfully compromised the security measures of your network","tags":["IT Operations","Monitoring"]},{"id":"9780132466769","language":"en","level":"Beginner","title":"Navigating U.S. Investment Markets","authors":["Tom Lydon"],"pages":"10","publication_date":"February 2010","description":"This Element is an excerpt from The ETF Trend Following Playbook: Profiting from Trends in Bull or Bear Markets with Exchange Traded Funds (ISBN: 9780137029013) by Tom Lydon. Available in print and digital formats.\n\nIdentifying market trends: what you can (and can’t) learn from the major market indexes.\n\nHunting for trends? An easy way to start is with the U.S. major market indexes. The Dow Jones Industrial Average (DJIA), the barometer for the U.S. equity markets, is monitored by investors worldwide. But it’s only 30 stocks—far from diversified. For a better representation of U.S. stocks, you might pick the S&P 500 or Russell 2000.","tags":["IT Operations","Virtualization","Containers","Container Platforms","Packer"]},{"id":"0131345907","language":"en","level":"Intermediate to advanced","title":"Understanding DB2® 9 Security: DB2® Information Management Software","authors":["Rebecca Bond","Kevin Yeung-Kuen See","Carmen Ka Man Wong"],"pages":"star rating fill","publication_date":"December 2006","description":"Understanding DB2 9 Security is the only comprehensive guide to securing DB2 and leveraging the powerful new security features of DB2 9. Direct from a DB2 Security deployment expert and the IBM® DB2 development team, this book gives DBAs and their managers a wealth of security information that is available nowhere else. It presents real-world implementation scenarios, step-by-step examples, and expert guidance on both the technical and human sides of DB2 security.\n\nThis book’s material is organized to support you through every step of securing DB2 in Windows®, Linux®, or UNIX® environments. You’ll start by exploring the regulatory and business issues driving your security efforts, and then master the technological and managerial knowledge crucial to effective implementation. Next, the authors offer practical guidance on post-implementation auditing, and show how to systematically maintain security on an ongoing basis.\n\nCoverage includes\n\nEstablishing effective security processes, teams, plans, and policies\n\nImplementing identification and authentication controls, your first lines of defense\n\nDB2 in Windows environments: managing the unique risks, leveraging the unique opportunities\n\nUsing the new Label Based Access Control (LBAC) of DB2 9 to gain finer-grained control over data protection\n\nEncrypting DB2 connections, data “in flight,” and data on disk: step-by-step guidance\n\nAuditing and intrusion detection: crucial technical implementation details\n\nUsing SSH to secure machine-to-machine communication in DB2 9 multi-partitioned environments\n\nStaying current with the latest DB2 security patches and fixes","tags":["IT Operations","Service Administration","Database Administration"]},{"id":"9780128126455","language":"en","level":"Intermediate to advanced","title":"Inspection and Monitoring Technologies of Transmission Lines with Remote Sensing","authors":["Yi Hu","Kai Liu"],"pages":"530","publication_date":"March 2017","description":"Inspection and Monitoring Technologies of Transmission Lines with Remote Sensing helps readers build a thorough understanding of new technologies and world-class practices developed by the State Grid Corporation of China—the organization responsible for the world’s largest power distribution network. Monitoring the operational status of high-voltage transmission lines is critical in supply assurance and continuity. Given the physical size, geographical, and climate variances that transmission lines are subject to, remote sensing and inspection is a critical technology for power distribution organizations. This reference covers current and developing technologies, equipment, and methods for the safe and secure operation and maintenance of transmission lines, including satellite remote sensing technology, infrared and ultraviolet detection technology, helicopter inspection technology, and condition monitoring technology.\n\nCovers operational and technical principles, and equipment used in transmission line inspection and monitoring, with a focus on remote sensing technologies and solutions\nCovers power line fundamentals, remote sensing technologies, inspection technologies, fault detection technologies, and on-line monitoring\nFocuses on practical equipment and systems parameters to ensure readers are able to meet operational needs\nCovers control technologies that ensure safe and consistent transmission operation","tags":["IT Operations","Monitoring"]},{"id":"9781430236443","language":"en","level":"Intermediate to advanced","title":"ELIMINATING \"US AND THEM\": USING IT GOVERNANCE, PROCESS, AND BEHAVIORAL MANAGEMENT TO MAKE IT AND THE BUSINESS \"ONE\"","authors":["Steven Romero"],"pages":"star rating fill","publication_date":"June 2011","description":"Challenging popular notions of what it takes for IT organizations to succeed, CA Technologies, Inc. IT Governance Evangelist Steve Romero presents many of the theories and ideas around IT governance, the key components of successful process management, and the direct relationship of behavioral management as key factors in IT's success.\n\nThe topic of IT governance has never been more popular than it is today. Almost every organization recognizes the need to establish sound IT governance, and almost every enterprise is still very immature when it comes to the discipline. This book challenges and calls into question the traditional approaches and strategies for running IT organizations. The concepts presented in the book are timeless, but reflect the recent changes in the organization's view of the role of the IT department. IT can become a major asset to an organization, often even becoming \"the product\" in today's Internet-based sales environment. Eliminating \"Us and Them\" discusses these changes and presents three areas that contribute most to the change from an alienated and oft-despised department to a key tool for organizational success:\n\nAn in-depth understanding of IT governance which has never been more popular than it is today.\n\nAn in-depth understanding of process and process management -- a discipline that more and more enterprises are investing in and establishing formal organizational constructs to enable and support.\n\nA case-study view of how an enterprise can establish, promote and instill the values that foster the behaviors of every person in the organization with the intent of influencing their ability to realize enterprise goals.\n\nRomero's insights are based on more than 30 years working in IT and over four years as an IT governance evangelist, traveling around the world, speaking at hundreds of events, and visiting more than 100 companies espousing the approach in this book.\n\nWhat you'll learn\n\nIf you are an IT professional, you'll see how you can help become more important to your organization. If you are a manager, you will understand what IT can bring to your organization and how to accomplish it. After reading this book:\n\nYou will have an acute understanding of IT governance and will be able to engage the topic from a business perspective or an IT perspective.\n\nYou will gain in-depth insights into the discipline of process management.\n\nYou will understand the art and science of process management and will have a much greater ability to successfully establish and maintain business processes.\n\nYou will have an understanding of how behavior influences enterprise success, and how to go about fostering behaviors necessary for enterprise success.\n\nWho this book is for\n\nThis topic is a universally recognized problem that finally has a reasonable solution. The book will be quite useful for IT professionals looking to make their role more meaningful in the organization, but the book is written so that managers will come around and see that they have a very important untapped asset–their IT department–that they can turn around quickly to meet the needs of the organization. The book also appeals to laypeople who have seen the disconnect between IT and the organization at large, and are interested in solutions to this problem.","tags":["IT Operations","IT Management"]},{"id":"9781449317775","language":"en","level":"Intermediate to advanced","title":"Developing with Google+","authors":["Jennifer Murphy"],"pages":"star rating fill","publication_date":"September 2012","description":"Would you like to integrate Google+ with an existing website, or build your own social application on the platform? Developing with Google+ takes you on a tour of the Google+ APIs, with lots of concrete examples and hands-on projects. You’ll learn how to take advantage of Google+ social plug-ins, communicate programmatically with Google+ over REST APIs, and author real-time Hangout Apps.\n\nOver the course of this book, you’ll follow the progress of a fictional company, Baking Disasters, as it incorporates all the features of the Google+ platform.\n\nMake the most of social widgets such as the +1 button, Badge, and the Share button\nUse performance tuning techniques to speed up social plugins on your site\nCreate your own plugins by accessing public data APIs with RESTful web services\nTransform an blog into a social web application through server-side processing\nUse OAuth to authenticate users and authorize your access to their private data\nExtend Google+ Hangouts programmatically and create your own application","tags":["IT Operations","Cloud Computing","Cloud Platforms","Google Cloud","Google App Engine"]},{"id":"9781587140617","language":"en","level":"Beginner","title":"Cisco Unified Presence Fundamentals","authors":["Brian Morgan - CCIE No. 4865","Shane Lisenbea","III - CCIE No. 9599 Michael C. Popovich"],"pages":"star rating fill","publication_date":"June 2010","description":"Cisco Unified Presence Fundamentals\n\nLearn how to use Cisco Unified Presence Server and Client to streamline communication and improve business agility\n\nBrian Morgan, CCIE No. 4865\n\nShane Lisenbea\n\nMichael C. Popovich III, CCIE No. 9599\n\nCisco® Unified Presence offers companies powerful opportunities to improve productivity. Building on the migration to IP telephony and the deployment of Cisco Unified Communications environments, it helps people find each other faster, solve problems more quickly, pursue opportunities with more agility, and increase customer satisfaction.\n\nWritten by three leading Cisco experts, Cisco Unified Presence Fundamentals explains the concepts behind Unified Presence, the technologies involved, their interdependencies, and how to troubleshoot them. The authors support their discussions of concepts and techniques with many sample applications, guiding network professionals to real-world mastery even if they have never used presence technologies.\n\nThis book will be an indispensable resource for all Cisco partners and system integrators who need to understand Unified Presence and build solutions, and for all IT and networking professionals who must work with or support those solutions. This is the only book that\n\nWalks readers step by step through configuring Cisco Unified Presence\n\nPresents practical sample applications that encourage readers to explore and innovate in their own organizations\n\nThoroughly covers the technical aspects of deploying Presence and explains how it can be used within key vertical markets\n\nPresents troubleshooting techniques from both server- and client-side perspectives\n\nPlan, install, configure, support, and profit from Cisco Unified Presence\n\nUnderstand the components of a Cisco Unified Presence solution and how they fit together\n\nGain valuable insight into how Cisco Unified Presence can increase productivity, scheduling capabilities, and interactivity for evolving industries\n\nUnderstand crucial interdependencies that impact Cisco Unified Presence design, functionality, and behavior\n\nConfigure Cisco Unified Presence for Federation\n\nUnderstand how to resolve Unified Presence issues with built-in tools and diagnostic utilities\n\nThis book is part of the Cisco Press® Fundamentals Series. Books in this series introduce networking professionals to new networking technologies, covering network topologies, sample deployment concepts, passwords, and management techniques.\n\nCategory: Networking/Voice Over IP\n\nCovers: Cisco Unified Presence","tags":["IT Operations","Computer Networking","Cisco"]},{"id":"9780321573223","language":"en","level":"Beginner","title":"The iPod and iTunes Pocket Guide, Fourth Edition","authors":["Christopher Breen"],"pages":"352","publication_date":"October 2008","description":"Here is your essential companion to the iPod nano, touch, classic, and shuffle and to iTunes. The iPod & iTunes Pocket Guide, Fourth Edition, steers you through how to:\n\nImport songs into iTunes, assemble playlists on your own or using the iTunes Genius, and burn CDs.\n\nFind music, movies, HD TV shows, videos, games, and audiobooks in the iTunes Store and see recommendations, discover new artists, and send gift certificates.\n\nBuy music from the iTunes Wi-Fi Music Store and sync songs with your computers.\n\nUse your iPod to keep contacts, view events, and store files.\n\nMake your iPod even more useful (and awe your friends) with fascinating tips and tricks.\n\nFix common problems and learn what to do in you can't fix them yourself.","tags":["Business","Business / Personal Technology","Personal Software","iTunes"]},{"id":"9781119974291","language":"en","level":"Intermediate to advanced","title":"Multihop Wireless Networks: Opportunistic Routing","authors":["Kai Zeng","Wenjing Lou","Ming Li"],"pages":"305","publication_date":"October 2011","description":"This book provides an introduction to opportunistic routing an emerging technology designed to improve the packet forwarding reliability, network capacity and energy efficiency of multihop wireless networks\n\nThis book presents a comprehensive background to the technological challenges lying behind opportunistic routing. The authors cover many fundamental research issues for this new concept, including the basic principles, performance limit and performance improvement of opportunistic routing compared to traditional routing, energy efficiency and distributed opportunistic routing protocol design, geographic opportunistic routing, opportunistic broadcasting, and security issues associated with opportunistic routing, etc. Furthermore, the authors discuss technologies such as multi-rate, multi-channel, multi-radio wireless communications, energy detection, channel measurement, etc. The book brings together all the new results on this topic in a systematic, coherent and unified presentation and provides a much needed comprehensive introduction to this topic.\n\nKey Features:\n\nAddresses opportunistic routing, an emerging technology designed to improve the packet forwarding reliability, network capacity and energy efficiency of multihop wireless networks\n\nDiscusses the technological challenges lying behind this new technology, and covers a wide range of practical implementation issues\n\nExplores many fundamental research issues for this new concept, including the basic principles of opportunistic routing, performance limits and performance improvement, and compares them to traditional routing (e.g. energy efficiency and distributed opportunistic routing protocol design, broadcasting, and security issues)\n\nCovers technologies such as multi-rate, multi-channel, multi-radio wireless communications, energy detection, channel measurement, etc.\n\nThis book provides an invaluable reference for researchers working in the field of wireless networks and wireless communications, and Wireless professionals. Graduate students will also find this book of interest.","tags":["IT Operations","Computer Networking","Wireless Networks"]},{"id":"30000LTI00081","language":"en","level":"Intermediate to advanced","title":"Infrastructure Planning and Design (IPD) Series Introduction","authors":["Microsoft, Inc."],"pages":"7","publication_date":"May 2008","description":"The Infrastructure Planning and Design (IPD) series provides architectural guidance for Microsoft ®infrastructure products. The series is designed to present the reader with the most concise planning guidance for Microsoft technologies. It also provides a means to validate design decisions with the business to ensure that the solution meets the requirements of both business and infrastructure stakeholders. The IPD introduction describes the background for the guides as well as the format of each guide and defines characteristics common to all of the guides.","tags":["IT Operations","Computer Networking","Infrastructure"]},{"id":"0672327023","language":"en","level":"Beginner","title":"Home Wireless Networking in a Snap","authors":["Joe Habraken"],"pages":"408","publication_date":"March 2006","description":"These days, nobody really wants to learn everything there is about their hardware and software. And even if you did, who has the time to endlessly tinker and play with it until you figure everything out? You just want a book that will quickly show you how to set up your home wireless network. Home Wireless Networking in a Snap is designed specifically for busy people like you.\n\nThis book covers the things that aren't already covered in the documentation that came with your equipment and the things you can't just figure out on your own. It is organized into a series of well-organized, bite-sized, quickly accomplished tasks, that lets you zero right in on particular tasks you want to accomplish. This hands-on approach to setting-up a secure home wireless network will have your network up and running in no time.","tags":["IT Operations","Computer Networking","Wireless Networks"]},{"id":"9780768686227","language":"en","level":"Intermediate to advanced","title":"Cloud Computing: Web-Based Applications That Change the Way You Work and Collaborate Online","authors":["Michael Miller"],"pages":"star rating fill","publication_date":"August 2008","description":"Cloud Computing: Web-Based Applications That Change the Way You Work and Collaborate On-Line\n\nComputing as you know it has changed. No longer are you tied to using expensive programs stored on your computer. No longer will you be able to only access your data from one computer. No longer will you be tied to doing work only from your work computer or playing only from your personal computer.\n\nEnter cloud computing–an exciting new way to work with programs and data, collaborate with friends and family, share ideas with coworkers and friends, and most of all, be more productive! The “cloud” consists of thousands of computers and servers, all linked and accessible to you via the Internet.\n\nWith cloud computing, everything you do is now web-based instead of being desktop-based; you can access all your programs and documents from any computer that’s connected to the Internet. Whether you want to share photographs with your family, coordinate volunteers for a community organization, or manage a multi-faceted project in a large organization, cloud computing can help you do it more easily than ever before. Trust us. If you need to collaborate, cloud computing is the way to do it.\n\n     •    Learn what cloud computing is, how it works, who should use it, and why it’s the wave of the future.\n\n     •    Explore the practical benefits of cloud computing, from saving money on expensive programs to accessing your documents ANYWHERE.\n\n     •    See just how easy it is to manage work and personal schedules, share documents with coworkers and friends, edit digital photos, and much more!\n\n     •    Learn how to use web-based applications to collaborate on reports and presentations, share online calendars and to-do lists, manage large projects, and edit and store digital photographs.\n\nMichael Miller is known for his casual, easy-to-read writing style and his ability to explain a wide variety of complex topics to an everyday audience. Mr. Miller has written more than 80 nonfiction books over the past two decades, with more than a million copies in print. His books for Que include Absolute Beginner’s Guide to Computer Basics,  Googlepedia: The Ultimate Google Resource, and Is It Safe?: Protecting Your Computer, Your Business, and Yourself Online. His website is located at www.molehillgroup.com.\n\nCovers the most popular cloud-based applications, including the following:\n\n     • Adobe Photoshop Express\n\n     • Apple MobileMe\n\n     • Glide OS\n\n     • Google Docs\n\n     • Microsoft Office Live Workspace\n\n     • Zoho Office\n\nCATEGORY:  Web Applications\n\nCOVERS:  Cloud Computing\n\nUSER LEVEL:  Beginner-Intermediate","tags":["IT Operations","Cloud Computing"]},{"id":"9780738458960","language":"en","level":"Intermediate to advanced","title":"Implementing IBM Spectrum Virtualize for Public Cloud on AWS Version 8.3.1","authors":["Jordan Fincher","Hemanand Gadgil","Vasfi Gucer"],"pages":"126","publication_date":"July 2020","description":"IBM® Spectrum Virtualize is a key member of the IBM Spectrum® Storage portfolio. It is a highly flexible storage solution that enables rapid deployment of block storage services for new and traditional workloads, whether on-premises, off-premises, or a combination of both.\n\nThe initial release of IBM Spectrum Virtualize for Public Cloud is now available on Amazon Web Services (AWS). This IBM Redpaper™ publication gives a broad understanding of the IBM Spectrum Virtualize for Public Cloud on AWS architecture. It also provides planning and implementation information about the common use cases for this new product.\n\nThis publication helps storage and networking administrators plan, implement, install, modify, and configure the IBM Spectrum Virtualize for Public Cloud on AWS offering Version 8.3.1. It also provides a detailed description of troubleshooting tips.","tags":["IT Operations","Cloud Computing","Cloud Platforms","IBM Cloud"]},{"id":"9780470277645","language":"en","level":"Intermediate to advanced","title":"Creating the Secure Managed Desktop: Using Group Policy, SoftGrid, Microsoft Deployment Toolkit, and Other Management Tools","authors":["Jeremy Moskowitz"],"pages":"719","publication_date":"June 2008","description":"Learn how to secure and manage every desktop in your network with Creating the Secure Managed Desktop: Using Group Policy, SoftGrid, Microsoft Deployment Toolkit, and Other Management Tools. Understand the tools and technologies you will need to create a more secure network using Windows Server 2008, Windows Vista and other Windows platforms and learn how to manage, diagnose, configure, update, and protect multiple desktops in an Active Directory network. Master automating tasks, setting and controlling settings, managing user profiles, and locking down systems from this must-have reference.","tags":["IT Operations","Computer Networking","Network Administration","Microsoft Network Administration"]},{"id":"9780738460451","language":"en","level":"Intermediate to advanced","title":"Implementation Guide for IBM Spectrum Virtualize for Public Cloud on Microsoft Azure Version 8.4.3","authors":["Andrew Greenfield","Jackson Shea","Katja Kratt"],"pages":"162","publication_date":"March 2022","description":"IBM® Spectrum Virtualize for Public Cloud is now available on Microsoft Azure. With IBM Spectrum® Virtualize for Public Cloud 8.4.3, users can deploy a highly available two-node cluster running IBM Spectrum Virtualize for Public Cloud on supported Microsoft Azure virtual machines (VMs). This all-inclusive, bring your own license (BYOL) software offering provides the ability to virtualize, optimize, and provision supported Azure Managed Disk to applications that require the performance of block storage in the cloud with the added efficiencies that IBM Spectrum Virtualize for Public Cloud brings to native infrastructure as a service (IaaS) that is provided by Microsoft Azure.\n\nThis IBM Redbooks publication gives a broad understanding of the IBM Spectrum Virtualize for Public Cloud on Azure architecture. It also provides planning and implementation details of the common use cases for this new product.\n\nThis book helps storage and networking administrators plan, implement, install, and configure the IBM Spectrum Virtualize for Public Cloud on Azure offering. It also provides valuable troubleshooting tips.","tags":["IT Operations","Cloud Computing","Cloud Platforms","IBM Cloud"]},{"id":"9780596802073","language":"en","level":"Intermediate to advanced","title":"iWork '09: The Missing Manual","authors":["Josh Clark"],"pages":"star rating fill","publication_date":"April 2009","description":"With iWork '09, Apple's productivity applications have come of age. Unfortunately, their user guides are stuck in infancy. That's where iWork '09: The Missing Manual comes in. This book quickly guides you through everything you need to know about the Pages word-processor, the Numbers spreadsheet, and the Keynote presentation program that Al Gore and Steve Jobs made famous.\n\nFriendly and entertaining, iWork '09: The Missing Manual gives you crystal-clear and jargon-free explanations of iWork's capabilities, its advantages over similar programs – and its limitations. You'll see these programs through an objective lens that shows you which features work well and which don't. With this book, you will:\n\nProduce stunning documents and cinema-quality digital presentations\nTake advantage of Mac OS X's advanced typography and graphics capabilities\nLearn how to use the collection of themes and templates included with iWork\nGet undocumented tips, tricks, and secrets for each program\nIntegrate with other iLife programs to use photos, audio, and video clips\n\nLearn why iWork is the topic most requested by Missing Manual fans. One of the few sources available on Apple's incredible suite of programs, iWork '09: The Missing Manual will help you get the best performance out of Pages, Numbers, Keynote, and more in no time.","tags":["Business","Business / Personal Technology","iWork"]},{"id":"9781449398699","language":"en","level":"Beginner","title":"iPod: The Missing Manual, 9th Edition","authors":["J.D. Biersdorfer"],"pages":"302","publication_date":"October 2010","description":"Apple's iPod still has the world hooked on portable music, pictures, videos, movies, and more, but one thing it doesn't have is a manual that helps you can get the most out this amazing device. That's where this book comes in. Get the complete scoop on the latest line of iPods and the latest version of iTunes with the guide that outshines them all -- iPod: The Missing Manual.\n\nThe 9th edition is as useful, satisfying, and reliable as its subject. Teeming with high-quality color graphics, each page helps you accomplish a specific task -- everything from managing your media and installing and browsing iTunes to keeping calendars and contacts. Whether you have a brand-new iPod or an old favorite, this book provides crystal-clear explanations and expert guidance on all of the things you can do:\n\nFill 'er up. Load your Nano, Touch, Classic, or Shuffle with music, movies, and photos, and learn how to play it all back.\nTour the Touch. Surf the Web, use web-based email, collect iPhone apps, play games, and more.\nShare music and movies. Copy music between computers with Home Sharing, beam playlists around the house, and whisk your Nano's videos to YouTube.\niTunes, tuned up. Pick-and-choose which music, movies, and photos to sync; create instant playlists with Genius Mix; and auto-rename \"Untitled\" tracks.\niPod power. Create Genius playlists on your iPod, shoot movies on your Nano, use the Nano's FM radio and pedometer, and add voice memos to your Touch.\nShop the iTunes Store. Find what you're looking for in a snap, whether it's music, movies, apps, lyrics, or liner notes.","tags":["Business","Business / Personal Technology","Personal Software","iTunes"]},{"id":"032132045X","language":"en","level":"Beginner","title":"iTunes 6 and iPod for Windows and Macintosh: Visual QuickStart Guide","authors":["Judith Stern","Robert Lettieri"],"pages":"296","publication_date":"December 2005","description":"Got a new iPod? Need to master it and iTunes fast? Try a Visual QuickStart! This best-selling reference's visual format and step-by-step, task-based instructions will have you up and running with the leading digital audio player and music store/jukebox in no time! In this popular guide, leading technology experts Judith Stern and Robert Lettieri use crystal-clear instructions and friendly prose to introduce you everything you need to know about getting the most from the latest iPods and iTunes 6. Filled with step-by-step, task-based instructions and loads of visual aids and tips, this book explains how to add music, videos, audiobooks, and podcasts to your iTunes library; synch your iPod to your computer; create and share iMixes; burn custom CDs; watch and make videos for the iPod; show slideshows on your iPod; understand Smart Playlists and AAC encoding; manage a Music Store account; use your iPod as hard drive, address book, and alarm clock; and more!","tags":["Business","Business / Personal Technology","Personal Software","iTunes"]},{"id":"9780738456652","language":"en","level":"Intermediate to advanced","title":"LDAP Authentication for IBM DS8000 Systems","authors":["Bert Dufrasne","Juan Brandenburg","Leandro De Souza Lopes"],"pages":"112","publication_date":"March 2018","description":"The IBM® DS8000® series includes the option to replace the locally based user ID and password authentication with a centralized directory-based approach.\n\nThis IBM Redpaper™ publication helps DS8000 storage administrators understand the concepts and benefits of a centralized directory. It provides the information that is required for implementing a DS8000 authentication mechanism that is based on the Lightweight Directory Access Protocol (LDAP).\n\nStarting with DS8000 Release 7.5, directory-based authentication relies on IBM Copy Services Manager (CSM) that provides the interface (the CSM LDAP client) between the DS8000 and external LDAP servers.","tags":["IT Operations","Computer Networking","Network Protocols","Internet Protocols","Lightweight Directory Access Protocol"]},{"id":"9780596806705","language":"en","level":"Beginner","title":"Up and Running with Joomla, 2nd Edition","authors":["R. Allen Wyke","Skip Matheny"],"pages":"star rating fill","publication_date":"July 2009","description":"Need to launch a feature-rich website quickly where you have one or more people authoring the content? Want to use a powerful, robust, and scalable Content Management System (CMS) you can trust? This Short Cut will get you up and running with Joomla 1.5, a freely available open source CMS. Learn how to install, configure, customize, and extend your Joomla installation. Also learn the tricks of the trade in how to set up and manage both your content and your users. Joomla can be a challenge to understand at first, so drastically cut your \"get up to speed\" time by taking the Short Cut!","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","Joomla"]},{"id":"9780321590961","language":"en","level":"Beginner","title":"Joomla!: Visual QuickStart Guide","authors":["Marni Derr","Tanya Symes"],"pages":"312","publication_date":"November 2008","description":"Joomla! is one of the fastest growing Open Source Content Management Systems on the market today and has won multiple awards since it's release in 2005. Currently, Joomla! has the largest 3rd party developer and designer community, with over 160,000 current registered users, over 2,000 templates, and 3,000 extensions. This task-based guide to creating, customizing, and maintaining a dynamic Joomla! 1.5 web site starts with the fundamental concepts and advantages of a Content Management System and then walks the user through setting up a server environment, downloading and installing Joomla!, adding and structuring content, using components, modules, and plugins, and administrating from both the back and front-ends. The book finishes with more advanced topics, including CSS, search engine optimization (SEO), and customizing templates and the Joomla! framework itself. It's the perfect guide to getting started with Joomla or for those users that want to expand their skills.","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","Joomla"]},{"id":"9780080556765","language":"en","level":"Intermediate to advanced","title":"Network Simulation Experiments Manual, 2nd Edition","authors":["Emad Aboelela"],"pages":"197","publication_date":"December 2007","description":"Network Simulation Experiments Manual, Second Edition, enables networking professional to visualize how networks work by providing free access to easy-to-install OPNET software. This software provides a virtual environment for modeling, analyzing, and predicting the performance of IT infrastructures, including applications, servers, and networking technologies.\n\nThe book also goes a step further by providing detailed experiments on core networking topologies for use in this simulation environment. Each experiment is also accompanied by review questions, a lab report, and exercises.\n\nThis book is recommended for graduate students and networking designers and professionals.\n\nUseful experimentation for professionals in the workplace who are interested in learning and demonstrating the capability of evaluating different commercial networking products\nThe experiments in this manual are closely tied to Peterson/Davie: Computer Networks, fourth edition (a best-selling Morgan Kaufmann title), making it a perfect companion book.","tags":["IT Operations","Computer Networking"]},{"id":"9780137008148","language":"en","level":"Intermediate to advanced","title":"Policy Technologies for Self-Managing Systems","authors":["Dakshi Agrawal","Seraphin Calo","Kang-Won Lee"],"pages":"star rating fill","publication_date":"October 2008","description":"Policy Technologies for Self-Managing Systems\n\nDakshi Agrawal\n\nCalo Seraphin\n\nKang-won Lee\n\nJorge Lobo\n\nDinesh Verma\n\nUse policies to build self-managing IT systems that save money, improve availability, and enhance agility\n\nIT policies can be used to guide and automate decision making in the management of computer and network infrastructure, helping IT organizations reduce costs, improve service quality, and enhance business agility. Now, a team of top IBM researchers introduces the latest innovations in policies and autonomic computing and demonstrates how to put them to work in your organization.\n\nThe authors cover the entire policy lifecycle: planning, definition, representation in standard policy languages, validation, distribution, enforcement, and more. They identify proven patterns for designing policy-enabled self-managing systems and show how policies can be integrated into a complete framework for system self management. They carefully introduce key technologies such as rules engines and the IBM Policy Management framework, as well as emerging standards such as the DMTF’s Common Information Model. Finally, they offer start-to-finish case studies of policy management in areas ranging from storage and IP networking to security.\n\nThis book’s insights and practical guidance will be invaluable to every IT\n\nprofessional who can benefit from policies: architects, developers, administrators, researchers, and managers alike.\n\nCoverage includes\n\nUnderstanding the life cycle and components of policy-based self-managing systems\n\nIdentifying your best opportunities to drive value from policies\n\nDefining the most appropriate abstraction level for your policies\n\nUsing the DMTF’s Common Information Model to establish the logical structure and contents of policies\n\nValidating the consistency and appropriateness of your policies\n\nMaking your policies automatically enforceable by computer\n\nUsing policies to simplify and streamline configuration management for SANs and other IT systems\n\nImproving availability by implementing policies that can automatically react to faults and error conditions","tags":["IT Operations","IT Management","IT Service Management"]},{"id":"9780768694079","language":"en","level":"Beginner","title":"My iPod touch","authors":["Brad Miser"],"pages":"star rating fill","publication_date":"September 2009","description":"Covers OS 3.0\n\nStep-by-step instructions with callouts to iPod touch photos so that you can see exactly what to do.\n\nHelp when you run into iPod touch problems or limitations.\n\nTips and Notes to help you get the most from your iPod touch.\n\nFull-color, step-by-step tasks walk you through getting and keeping your iPod touch working just the way you want.\n\nLearn how to:\n\n•   Make the most of Apple’s newest iPod touch 3.0 software\n\n•   Connect your iPod touch to Wi-Fi networks and the Internet\n\n•   Move content onto your iPod touch\n\n•   Synchronize your iPod touch with a computer, MobileMe, or Exchange\n\n•   Listen to music, podcasts, and other audio\n\n•   Watch movies, TV shows, music videos, and video podcasts\n\n•   Surf the Web and email\n\n•   Create, manage, display, and edit contacts and calendar entries\n\n•   Store, view, and share your photos\n\n•   Find, install, use, and maintain iPod touch applications\n\n•   Customize, maintain, and troubleshoot your iPod touch\n\nBONUS MATERIAL: Find additional tasks and other helpful information on this book’s website at www.informit.com/title/9780789742391","tags":["Business","Business / Personal Technology","Personal Software","iTunes"]},{"id":"9781631571831","language":"en","level":"Beginner","title":"The Human Side of Virtual Work","authors":["Laurence M. Rose"],"pages":"150","publication_date":"December 2015","description":"The virtual work world is upon us. It is ever increasing as both workers and organizations become more familiar with this new structure. The way leaders and managers deal with the virtual worker will become increasingly more important. This book takes a look at the virtual work environment from a view of human perceptions. Trust, isolation, and presence are the three main human perceptions discussed throughout the book and are the foundation for the theory presented. The Change–Self-Efficacy Loop Theory provides the basis for a new tool to maximize the productivity level of the virtual worker. The book takes a journey from the industrial revolution through a second shift or technology revolution which we are currently experiencing known as the virtual work environment. It presents argument and ideas to encourage all of us to take action now to prevent the potential negative outcomes that could affect many working in the virtual work environment. The book is designed for anyone associated with the virtual work environment. Based on the premise that the virtual work environment needs to be a productive alternative to the traditional work environment, the book focuses on variables that can create the most successful outcome.","tags":["IT Operations","Virtualization"]},{"id":"9780789737151","language":"en","level":"Intermediate to advanced","title":"CCENT Exam Cram (Exam 640-822)","authors":["Michael Valentine","Andrew Whitaker"],"pages":"384","publication_date":"December 2007","description":"In this book, you learn how to:\n\nDevelop perfect fluency in subnetting\n\nUnderstand the OSI model and the Cisco three-layer hierarchical model\n\nConnect Cisco equipment, make initial configurations, and connect to other devices to build a network\n\nConfigure Cisco routers and back up and restore your Cisco IOS Software configurations\n\nImplement, verify, and troubleshoot a small, switched network\n\nConfigure and verify a basic WAN serial connection\n\nUnderstand and apply wireless LAN (WLAN) concepts\n\nMitigate network security threats and secure network devices\n\nConfigure static routes and RIPv2\n\nConnect a small office to the Internet\n\nWRITTEN BY CCNA/CCENT Experts!\n\nMichael Valentine has been in the IT field for 12 years, focusing on network design and implementation. He is currently a Cisco trainer with Skyline Advanced Technology Services and specializes in Cisco Unified Communications instruction as well as CCNA and CCNP courses.\n\nAndrew Whitaker is the director of enterprise InfoSec and networking and senior training instructor for Training Camp. He has achieved several Cisco certifications and has written on several Cisco topics.\n\nThis book includes a CD-ROM that features:\n\nComplete coverage of CCENT exam objectives\n\nRealistic exam questions for effective practice\n\nDetailed explanations of correct and incorrect answers\n\nMultiple exam modes\n\nFlash Card format\n\nAn electronic copy of the book","tags":["IT Operations","IT Certifications","Cisco Certifications","CCENT"]}]