[{"id":"9781118206911","language":"en","level":"Beginner","title":"HTML & CSS: Design and Build Websites","authors":["Jon Duckett"],"pages":"star rating fill","publication_date":"November 2011","description":"A full-color introduction to the basics of HTML and CSS from the publishers of Wrox!\n\nEvery day, more and more people want to learn some HTML and CSS. Joining the professional web designers and programmers are new audiences who need to know a little bit of code at work (update a content management system or e-commerce store) and those who want to make their personal blogs more attractive. Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach.\n\nIntroduces HTML and CSS in a way that makes them accessible to everyone—hobbyists, students, and professionals—and it's full-color throughout\n\nUtilizes information graphics and lifestyle photography to explain the topics in a simple way that is engaging\n\nBoasts a unique structure that allows you to progress through the chapters from beginning to end or just dip into topics of particular interest at your leisure\n\nThis educational book is one that you will enjoy picking up, reading, then referring back to. It will make you wish other technical topics were presented in such a simple, attractive and engaging way!","tags":["Web & Mobile","Web Development","Frontend Web Development","HTML"]},{"id":"9781788629690","language":"en","level":"Intermediate to advanced","title":"Real-Time 3D Graphics with WebGL 2 - Second Edition","authors":["Farhad Ghayour","Diego Cantor"],"pages":"star rating fill","publication_date":"October 2018","description":"Learn how to create real-time 3D graphics directly in your browser with \"Real-Time 3D Graphics with WebGL 2\". This book guides you through the essentials of 3D computer graphics programming using the powerful WebGL 2 API. From foundational rendering techniques to advanced graphical features, you'll gain the skills to build visually stunning, dynamic, and interactive 3D applications.\n\nWhat this Book will help me do\n\nUnderstand the rendering pipeline in WebGL and how it facilitates 3D graphics.\nDevelop the skills to model, transform, and display 3D objects in a browser environment.\nImplement complex graphics features like lighting, shading, and camera movements.\nLearn advanced WebGL 2 techniques to add realism and interactivity to graphics.\nCreate complete, interactive 3D applications with real-time feedback.\n\nAuthor(s)\n\nFarhad Ghayour and Diego Cantor are seasoned experts in 3D graphics and software development. With practical experience in leveraging WebGL for building highly interactive graphics, they bring their real-world insights into accessible learning material. Their books emphasize hands-on learning, ensuring readers not only understand theoretical concepts but also gain practical skills directly applicable to web development projects.\n\nWho is it for?\n\nThis book is perfect for JavaScript developers looking to dive into the world of 3D web graphics. Whether you're familiar with other graphics libraries or entirely new to 3D programming, this book will guide you step by step. With its emphasis on hands-on learning, it's suited for anyone who is eager to create engaging web experiences using modern 3D rendering techniques. If you aim to learn WebGL 2 efficiently and effectively, this book is for you.","tags":["Web & Mobile","Web Development","JavaScript","Three.js"]},{"id":"9781484297803","language":"en","level":"Intermediate to advanced","title":"Coding Art: A Guide to Unlocking Your Creativity with the Processing Language and p5.js in Four Simple Steps","authors":["Mathias Funk","Yu Zhang"],"pages":"342","publication_date":"November 2023","description":"Finally, a book on creative programming, written directly for artists and designers! This second edition offers expanded and updated content incorporating the latest advancements and trends in the field of creative programming, also for creatives who want to work directly with P5.js and online. It delves deeper into the intricacies of computational art. It includes fresh case studies that explore real-world applications of coding art, inspiring readers to think beyond traditional boundaries.\nRather than following a computer science curriculum, this book is aimed at creatives who are working in the intersection of design, art, and education. Following a real-world use case of computation art, you'll see how it relates back to the four key pillars, and addresses potential pitfalls and challenges in the creative process. All code examples are presented in a fully integrated Processing example library, making it easy for readers to get started. \nThis unique and finely balanced approach between skill acquisition and development makes Coding Art, Second Edition the ideal reference book for both creative programming and the creative process for professors and students alike.\n\nWhat You’ll Learn\n\nReview ideas and approaches from creative programming to different professional domains\nWork with computational tools like the Processing language\nUnderstand the skills needed to move from static elements to animation to interaction\nUse interactivity as input to bring creative concepts closer to refinement and depth\nSimplify and extend the design of aesthetics, rhythms, and smoothness with data structures\nLeverage the diversity of art code on other platforms like the web or mobile applications\nUnderstand the end-to-end process of computation art through real world use cases\nStudy best practices, common pitfalls, and challenges of the creative process\nWho This Book Is For\nThose looking to see what computation and data can do for their creative expression; learners who want to integrate computation and data into their practices in different perspectives; creative technologists, educators, digital artists and those who already know how to program, seeking creativity and inspiration in the context of computation and data.","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781805125006","language":"en","level":"Intermediate to advanced","title":"The MVVM Pattern in .NET MAUI","authors":["Pieter Nijs"],"pages":"386","publication_date":"November 2023","description":"The MVVM Pattern in .NET MAUI is your essential guide to implementing the Model-View-ViewModel design pattern for building robust and maintainable cross-platform applications. This book provides a comprehensive exploration of the MVVM pattern within the context of .NET MAUI and equips you with practical skills to create high-quality apps.\n\nWhat this Book will help me do\n\nUnderstand the MVVM design pattern and its importance for app development.\nMaster the MVVM-enabling features unique to .NET MAUI.\nLearn to efficiently use data binding techniques in real-world applications.\nDevelop expertise in implementing navigation and localization in your applications.\nAcquire the skills to write testable and maintainable application code.\n\nAuthor(s)\n\nPieter Nijs is a seasoned software developer passionate about app development and modern design patterns. With extensive experience in .NET technologies, Pieter brings a wealth of practical insight and a clear teaching style to his writing, helping developers tackle challenges effectively.\n\nWho is it for?\n\nThis book is geared towards C# developers with some .NET MAUI or Xamarin.Forms experience who want to deepen their understanding of the MVVM pattern. If you're aiming to enhance the maintainability and scalability of your cross-platform applications, this book is a must-read. Aspiring and seasoned developers alike will benefit from the expert insights and methodologies provided.","tags":["Web & Mobile","Mobile Development",".NET MAUI"]},{"id":"9781633439832","language":"en","level":"Beginner to intermediate","title":"Tiny CSS Projects","authors":["Michael Gearon","Martine Dowden"],"pages":"star rating fill","publication_date":"August 2023","description":"CSS is a must-know language for all web developers. In this practical book, you’ll explore numerous techniques to improve the way you write CSS as you build 12 tiny projects. In Tiny CSS Projects you’ll build twelve exciting and useful web projects including:\nA loading screen created by styling SVG graphics\nA responsive newspaper layout with multiple columns\nAnimating social media buttons with pseudo-elements\nDesigning layouts using CSS grids\nSummary cards that utilize hover interactions\nStyling forms to make them more appealing to your users\nThe projects may be tiny, but the CSS skills you’ll learn are huge! Tiny CSS Projects teaches you how to make beautiful websites and applications by guiding you through a dozen fun coding challenges. You’ll learn important skills through hands-on practice as you tinker with your own code and make real creative decisions about the projects you’re building. You’ll rapidly master the basics and then press on into CSS’s exciting layout features including grid and flexbox, animations, transitions, and media queries.About the TechnologyDon’t settle for boring web pages! With Cascading Style Sheets you can control color, layout, and typography to make your sites both functional and beautiful. CSS is an essential skill for web developers and designers. This book will help you get started the right way.About the BookTiny CSS Projects builds your CSS skills by guiding you through 12 creative mini-projects. Each interesting challenge starts with a downloadable HTML skeleton. As you flesh it out with your own design ideas, you’ll master CSS concepts like transitions, layout, and styling forms, and explore powerful features including Flexbox and Grid. All the skills you’ll learn are easy to transfer to full-size applications. When you finish, you’ll have an exciting portfolio of designs ready to go for your next project.What's Inside\nTransitions and animations using keyframes\nLayout techniques including Grid and Flexbox\nStyling form elements including radio buttons\nEmbedding fonts and typography-related styles\nConditional styling using pseudo-elements and media queries\nAbout the ReaderFor readers who know the basics of HTML and frontend development. No previous experience with CSS is required.About the AuthorsMartine Dowden is an author, speaker, and award-winning CTO. Michael Gearon is a user experience designer and frontend developer who has worked with many well-known brands.QuotesA great project-based approach to learning CSS with something for all skill levels.- Joe Attardi, author of Modern CSSAn excellent resource! Written in simple language with plenty of applicable examples. This book proves that it is never too late to learn, even after decades of experience. I highly recommend it!- Joseph Del Vecchio, Heritage Environmental ServicesClear and concise so it’s easy to understand…makes learning engaging and fun. The instructions and code are well-organized and easy to follow.- Md. Zahid Hossain, Webapp Solutions","tags":["Web & Mobile","Web Development","Frontend Web Development","CSS"]},{"id":"9781788296335","language":"en","level":"Beginner to intermediate","title":"Firebase Cookbook","authors":["Houssem Yahiaoui"],"pages":"star rating fill","publication_date":"November 2017","description":"Explore the powerful features of Firebase through over 70 practical recipes for creating real-time web and mobile applications. This book provides actionable solutions that cover Firebase Authentication, Cloud Functions, and Realtime Database integration.\n\nWhat this Book will help me do\n\nMaster Firebase Authentication to secure your apps effectively.\nIntegrate Firebase Cloud Functions for a serverless backend.\nUtilize Firebase Realtime Database for seamless data management.\nImplement Firebase Admin SDK for privileged actions in your apps.\nDevelop cross-platform mobile apps using Firebase integrations.\n\nAuthor(s)\n\nHoussem Yahiaoui is a seasoned developer and experienced technologist with a deep passion for creating accessible learning materials. He aims to demystify complex topics by presenting them in a practical and engaging way.\n\nWho is it for?\n\nThis book is perfect for developers with a basic knowledge of JavaScript, HTML, and CSS who are looking to leverage Firebase to develop robust web and mobile applications. It is ideal for those seeking to explore modern backend solutions utilizing Firebase's capabilities.","tags":["Web & Mobile","Web Development","Google Firebase"]},{"id":"9798868814839","language":"en","level":"Intermediate to advanced","title":"Practical Marko: Progressive HTML Rendering and Micro Front-Ends","authors":["Damodaran Chingleput Sathyakumar"],"pages":"746","publication_date":"September 2025","description":"With the recent evolution of frontend frameworks toward the server, there has been a growing interest in server-side rendering and optimizing for the server to unlock greater performance gains. In this context, this book explores Marko JS—a View framework that is heavily optimized for both the server and the client—and discusses techniques using Marko that can help enterprises achieve significant performance improvements.Focusing on techniques involving Marko, you will learn about topics such as Progressive Rendering, HTML Streaming, server-sent events, and event source APIs. Alongside these techniques, the book will teach you how to accelerate the development of Marko apps quickly and easily using its meta-framework, Marko Run, as well as how to achieve distributed and decoupled applications at scale via server-side micro-frontends that allow for the transclusion of one application into another.A key area of emphasis in the book is the technique of Progressive Rendering, which differs from traditional server-side rendering techniques, where rendering is fully awaited until the entire HTML is generated before being sent. Finally, the book helps you apply these techniques in practical scenarios and teaches you how to build a sample application. By reading this book, you will not only become intimately familiar with high-performance server-side techniques in Marko but also gain expertise in applying these techniques to real-world use cases.\n\nWhat You'll Learn:\n\nHow to build high performance websites through techniques – Progressive Rendering and HTML Streaming\nAchieve decoupled and distributed applications via a new paradigm of micro-frontends called micro-frames.\nGain familiarity with advanced, efficient server-side rendering techniques for optimizing page load time using Marko, via its meta framework Marko-run.\n\nWho is this book for:\n\nWeb developers, front-end engineers, full stack engineers, programmers","tags":["Web & Mobile","Web Development","Frontend Web Development","HTML"]},{"id":"9798868820625","language":"en","level":"Intermediate to advanced","title":"Practical PHP APIs with Symfony: A Step-by-Step Guide for Building Operation-Oriented APIs","authors":["Nacho Colomina Torregrosa"],"pages":"170","publication_date":"October 2025","description":"Ever wanted to construct a robust and efficient API architecture that revolves around operations? This focused pocket guide takes you through that process step-by-step, providing you with the knowledge to build an operation-oriented API using the PHP programming with the Symfony framework.\n\nPractical PHP APIs with Symfony is designed to provide you with a comprehensive understanding of how to create a single API endpoint that embraces the concept of operations. We will utilize the robust features of Symfony to build an environment where operations are the focal point of our API design. This focused guide assumes a certain understanding of the Symfony framework and is not intended as an introductory text to the topic.\n\nWith this in mind, we will cover essential Symfony topics such as dependency injection features, security authentication and background operations with Symfony Messenger, all with the aim to get you up and running with operation-oriented APIs as quickly and easily as possible.\n\nYou Will:\n\nLearn the principles of constructing an API architecture centered around operations\nGain insights into the Symfony features that facilitate the development of operation-oriented APIs\nLearn how to create a single API endpoint that manages and executes various operations\nExplore essential Symfony topics, including dependency injection, security authentication, and the use of Symfony Messenger for background operations\nDevelop skills to discover, manage, and execute operations within your APIs, using practical examples for better comprehension\n\n This Book is For:\n\n Developers and software engineers with prior knowledge andunderstanding of the Symfony framework who wish to deepen their knowledge in building operation-oriented APIs, as well as those who are looking to know more about API design.","tags":["Web & Mobile","Web Development","PHP","Symfony"]},{"id":"9781491945308","language":"en","level":"Beginner","title":"SVG Essentials, 2nd Edition","authors":["J. David Eisenberg","Amelia Bellamy-Royds"],"pages":"star rating fill","publication_date":"October 2014","description":"Learn the essentials of Scalable Vector Graphics, the mark-up language used by most vector drawing programs and interactive web graphics tools. SVG Essentials takes you through SVG’s capabilities, beginning with simple line drawings and moving through complicated features such as filters, transformations, gradients, and patterns. This thoroughly updated edition includes expanded coverage of animation, interactive graphics, and scripting SVG.","tags":["Web & Mobile","Web Development","Frontend Web Development","SVG"]},{"id":"9781801813969","language":"en","level":"Intermediate to advanced","title":"Shopify Theme Customization with Liquid","authors":["Ivan Djordjevic"],"pages":"star rating fill","publication_date":"October 2021","description":"\"Shopify Theme Customization with Liquid\" is your gateway to mastering the customization of Shopify themes using Liquid. This book walks you through understanding Liquid's programming logic and Shopify's theme architecture, empowering you to create stunning and dynamic eCommerce websites. With a strong focus on hands-on examples, this guide will enhance your Shopify development skills significantly.\n\nWhat this Book will help me do\n\nUnderstand Shopify's theme architecture and how to utilize Liquid for advanced theme customization.\nMaster the use of Liquid objects, filters, and tags to implement dynamic features effectively.\nLeverage JSON settings and Shopify Ajax API to build modular and interactive website components.\nLearn how to apply metafields to create unique content customized to specific user needs.\nTransform designs with reusable and reconfigurable sections using Shopify's drag-and-drop interface.\n\nAuthor(s)\n\nNone Djordjevic is a seasoned web developer with extensive experience in eCommerce and Shopify theme customization. With a deep understanding of Liquid and modern web development practices, None crafts instructive content that simplifies complex topics. Through interactive and real-world examples, they guide readers towards being proficient Shopify developers.\n\nWho is it for?\n\n\"Shopify Theme Customization with Liquid\" is designed for web developers-from beginners to experienced professionals-who want to specialize in Shopify theme development. If you have a basic grasp of web technologies like HTML, CSS, and JavaScript and are eager to create top-notch eCommerce websites, this book is for you. Whether you're starting out with Shopify or looking to expand your skills, this book delivers valuable insights.","tags":["Web & Mobile","Web Development","Frontend Web Development","CSS"]},{"id":"9781680501780","language":"en","level":"Intermediate to advanced","title":"Secure Your Node.js Web Application","authors":["Karl Duuna"],"pages":"star rating fill","publication_date":"December 2015","description":"Cyber-criminals have your web applications in their crosshairs. They search for and exploit common security mistakes in your web application to steal user data. Learn how you can secure your Node.js applications, database and web server to avoid these security holes. Discover the primary attack vectors against web applications, and implement security best practices and effective countermeasures. Coding securely will make you a stronger web developer and analyst, and you'll protect your users.Bake security into your code from the start. See how to protect your Node.js applications at every point in the software development life cycle, from setting up the application environment to configuring the database and adding new functionality. You'll follow application security best practices and analyze common coding errors in applications as you work through the real-world scenarios in this book.Protect your database calls from database injection attacks and learn how to securely handle user authentication within your application. Configure your servers securely and build in proper access controls to protect both the web application and all the users using the service. Defend your application from denial of service attacks. Understand how malicious actors target coding flaws and lapses in programming logic to break in to web applications to steal information and disrupt operations. Work through examples illustrating security methods in Node.js. Learn defenses to protect user data flowing in and out of the application.By the end of the book, you'll understand the world of web application security, how to avoid building web applications that attackers consider an easy target, and how to increase your value as a programmer.What You Need:In this book we will be using mainly Node.js. The book covers the basics of JavaScript and Node.js. Since most Web applications have some kind of a database backend, examples in this book work with some of the more popular databases, including MySQL, MongoDB, and Redis.","tags":["Web & Mobile","Web Development","Node.js"]},{"id":"9781789530179","language":"en","level":"Intermediate to advanced","title":"React Design Patterns and Best Practices - Second Edition","authors":["Carlos Santana Roldán"],"pages":"star rating fill","publication_date":"March 2019","description":"Dive into the world of React with \"React Design Patterns and Best Practices,\" a book tailored to help you master techniques that will elevate your application's flexibility, performance, and maintainability. By understanding best practices and applying design patterns effectively, you'll learn to build production-ready applications with confidence.\n\nWhat this Book will help me do\n\nUnderstand and utilize the new React features such as the context API and Hooks to create modern applications.\nGain insights into styling and optimizing React components for better performance and appearance.\nLearn to implement consolidate patterns for effective component communication.\nMaster the use of server-side rendering to improve load times and application speed.\nDevelop robust and maintainable code by writing a comprehensive set of tests.\n\nAuthor(s)\n\nThe authors are seasoned software developers with years of experience in React and web application development. They have a passion for breaking down complex topics into understandable concepts. Their practical examples and step-by-step approach make this book accessible to developers aiming to deepen their React knowledge.\n\nWho is it for?\n\nThis book is directed at web developers aiming to improve their React skills and knowledge of best practices. It is ideal for those with a basic understanding of JavaScript and React who want to build professional-grade applications. Whether you are looking to refine your skills or apply React to larger projects, this book is right for you.","tags":["Web & Mobile","Web Development","JavaScript","JavaScript Frameworks","React"]},{"id":"9781787121386","language":"en","level":"Beginner to intermediate","title":"Django: Web Development with Python","authors":["Samuel Dauzon","Aidas Bendoraitis","Arun Ravindran"],"pages":"star rating fill","publication_date":"August 2016","description":"From an idea to a prototype – a complete guide for web development with the Django framework\n\nAbout This Book\n\nExplore the best practices to develop applications of a superior quality with Django framework\n\nUnravel the common problems of web development in Django\n\nThis course teaches you major Django functions and will help you improve your skills by developing models, forms, views, and templates\n\nExperience the challenges of working on an end-to-end social network project\n\nWho This Book Is For\n\nWeb developers who want to use modern Python-based web frameworks like Django to build powerful web applications. The course is mostly self-contained and introduces web development with Python to a reader who is familiar with web development concepts and can help him become an expert in this trade. It’s intended for all levels of web developers, both students and practitioners from novice to experts.\n\nWhat You Will Learn\n\nUse Django models to store information in the database and generate queries to access a database across models\n\nQuickly develop web pages to create, read, update, and delete data from the model using class-based views\n\nGenerate very maintainable forms with Django\n\nImport data from local sources and external web services as well as exporting your data to third parties\n\nDeep dive into various aspects of Django from models and views to testing and deployment\n\nFamiliarize yourself with the various nuances of web development such as browser attacks and databases\n\nIn Detail\n\nData science is hot right now, and the need for multitalented developers is greater than ever before. A basic grounding in building apps with a framework as minimalistic, powerful, and easy-to-learn as Django will be a useful skill to launch your career as an entrepreneur or web developer. Django is a web framework that was designed to strike a balance between rapid web development and high performance. This course will take you on a journey to become an efficient web developer thoroughly understanding the key concepts of Django framework. This learning path is divided into three modules. The course begins with basic concepts of the Django framework. The first module, Django Essentials, is like a practical guide, filled with many real-world examples to build highly effective Django web application. After getting familiar with core concepts of Django, it's time to practice your learning from the first module with the help of over 90 recipes available in this module. In the second module, Web Development with Django Cookbook, you'll learn varying complexities to help you create multilingual, responsive, and scalable websites with Django. By the end of this module, you will have a good understanding of the new features added to Django 1.8 and be an expert at web development processes.The next step is to discover the latest best practices and idioms in this rapidly evolving Django framework. This is what you'll be learning in our third module, Django Design Patterns and Best Practices. This module will teach you common design patterns to develop better Django code. By the end of the module, you will be able to leverage the Django framework to develop a fully functional web application with minimal effort.\n\nStyle and approach\n\nThis course includes all the resources that will help you jump into the web development field with Django and learn how to make scalable and robust web applications. The aim is to create a smooth learning path that will teach you how to get started with the powerful Django framework and perform various web development techniques in depth. Through this comprehensive course, you'll learn web development with Django from scratch to finish!\n\nDownloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at http://www.PacktPub.com. If you purchased this book elsewhere, you can visit http://www.PacktPub.com/support and register to have the code file.","tags":["Web & Mobile","Web Development","Python Web Frameworks","Django"]},{"id":"9781788620062","language":"en","level":"Intermediate to advanced","title":"Learn ECMAScript - Second Edition","authors":["MEHUL MOHAN","Narayan Prusty"],"pages":"star rating fill","publication_date":"February 2018","description":"Discover the power of modern JavaScript with 'Learn ECMAScript'. This book takes you through a detailed journey of the latest ECMAScript features, empowering you to write efficient, clean, and robust code. From asynchronous programming to shared memory management, you will gain the skills to tackle complex web applications confidently.\n\nWhat this Book will help me do\n\nMaster the latest features of ECMAScript to write cleaner and more efficient JavaScript code.\nLearn to use advanced JavaScript constructs, such as shared memory and web workers, for optimizing performance.\nUnderstand and implement modular programming in JavaScript to improve code structure and maintainability.\nGrasp asynchronous programming techniques in JS, including promises, async/await, and event loops.\nGain insights into applying ECMAScript standards to improve team development workflows.\n\nAuthor(s)\n\nNone Mohan and Narayan Prusty are seasoned developers with extensive experience in JavaScript and ECMAScript. They have a knack for simplifying complex topics and writing in-depth technical material that resonates with both beginners and experienced developers alike. Their combined expertise ensures that this book is both practical and informative.\n\nWho is it for?\n\n'Learn ECMAScript' is perfect for web developers looking to deepen their understanding of JavaScript and modern ECMAScript standards. If you have basic programming knowledge and want to progress from intermediate to advanced concepts, this book is tailored for you. It is ideal for developers who wish to write clean code and adopt best practices in JavaScript. This book is also suitable if you are interested in mastering asynchronous programming and modular architecture to enhance your development arsenal.","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781849516624","language":"en","level":"Beginner","title":"Apache Tomcat 7 Essentials","authors":["Tanuj Khare"],"pages":"star rating fill","publication_date":"March 2012","description":"Apache Tomcat 7 Essentials is your guide to mastering the setup, configuration, and maintenance of Apache Tomcat version 7. This book leads you through a structured path, from initial installation to advanced performance tuning, ensuring you have the skills to confidently deploy and manage Tomcat servers in various environments.\n\nWhat this Book will help me do\n\nLearn step-by-step installation of Apache Tomcat 7 on Windows and Linux platforms.\nGain the expertise to configure enterprise application setups with clustering and load balancing.\nMaster the art of performance tuning and issue diagnostics for Tomcat servers.\nUnderstand migration and upgrade procedures from earlier Tomcat versions to version 7.\nLearn best practices for high availability and optimization in production environments.\n\nAuthor(s)\n\nTanuj Khare brings his extensive experience in web hosting and server administration to offer a clear and practical guide to Tomcat 7. His expertise ensures the book is thorough and accessible, balancing theory with practical insights. As an educator and practitioner, he prioritizes equipping readers with actionable knowledge applicable to real-world scenarios.\n\nWho is it for?\n\nThis book is tailored for J2EE administrators, migration administrators, and technical architects responsible for Tomcat-based applications. The content assumes a basic understanding of application servers but supports progress from beginner to advanced technical proficiency. If managing or optimizing Tomcat servers is part of your role, this book is an ideal tool.","tags":["Web & Mobile","Web Development","Web & Application Servers","Tomcat"]},{"id":"9781617293863","language":"en","level":"Beginner","title":"JavaScript on Things","authors":["Lyza Gardner"],"pages":"star rating fill","publication_date":"March 2018","description":"JavaScript on Things is your first step into the exciting and downright entertaining world of programming for small electronics. If you know enough JavaScript to hack a website together, you'll be making things go bleep, blink, and spin faster than you can say \"nodebot.\"\n\nAbout the Technology\n\nAre you ready to make things move? If you can build a web app, you can create robots, weather stations, and other funky gadgets! In this incredibly fun, project-based guide, JavaScript hardware hacker Lyza Danger Gardner takes you on an incredible journey from your first flashing LED through atmospheric sensors, motorized rovers, Bluetooth doorbells, and more. With JavaScript, some easy-to-get hardware, and a bit of creativity, you'll be beeping, spinning, and glowing in no time.\n\nAbout the Book\n\nJavaScript on Things introduces the exciting world of programming small electronics! You'll start building things immediately, beginning with basic blinking on Arduino. This fully illustrated, hands-on book surveys JavaScript toolkits like Johnny-Five along with platforms including Raspberry Pi, Tessel, and BeagleBone. As you build project after interesting project, you'll learn to wire in sensors, hook up motors, transmit data, and handle user input. So be warned: once you start, you won't want to stop.\n\nWhat's Inside\n\nControlling hardware with JavaScript\nDesigning and assembling robots and gadgets\nA crash course in electronics\nOver a dozen hands-on projects!\nAbout the Reader\n\nWritten for readers with intermediate JavaScript and Node.js skills. No experience with electronics required.\n\nAbout the AuthorLyza Danger Gardner has been a web developer for over 20 years. She's part of the NodeBots community and a contributor to the Johnny-Five Node.js library.QuotesJavaScript breaks free of the browser with this book!- Amit Lamba, Tech OvertureThe most accessible and enjoyable book on IoT tech I have ever read.- Andrew Meredith, Quantum MetricCalling all developers! Unlock your inner hardware hacker with this exciting book.- Kevin Liao, Sotheby'sMakes developing low-level circuits fun. A pleasure to read!- Earl Bingham, You Technology","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781801073639","language":"en","level":"Beginner to intermediate","title":"Becoming an Enterprise Django Developer","authors":["Michael Dinder"],"pages":"star rating fill","publication_date":"June 2022","description":"Becoming an Enterprise Django Developer is your comprehensive guide to mastering Django for large-scale production applications. Through this book, you'll explore practices, design strategies, and tools that empower developers to create and manage Django-based solutions effectively.\n\nWhat this Book will help me do\n\nUnderstand the lifecycle of enterprise Django projects and how to design them effectively.\nExplore the various Django tools and frameworks for building scalable and reliable applications.\nLearn to extract, parse, and handle data effectively within Django projects.\nDevelop REST APIs and manage the backend efficiently using Django's extensive features.\nMaster testing and debugging practices to ensure the quality and stability of your Django applications.\n\nAuthor(s)\n\nAuthored by None Dinder and Michael Dinder, who are seasoned Django experts with years of experience in Python web development. They share their insights and approaches to building robust applications that operate at the enterprise level. Their writing focuses on practical knowledge and real-world applications.\n\nWho is it for?\n\nThis book is tailored for Django developers looking to elevate their skills to the enterprise level. If you're familiar with Python and Django basics and want to learn how to scale web applications effectively, this book aligns with your goals. Aspiring Django professionals aiming for production-level expertise will find immense value in this resource.","tags":["Web & Mobile","Web Development","Python Web Frameworks","Django"]},{"id":"9781484280829","language":"en","level":"Beginner","title":"PHP 8 Basics: For Programming and Web Development","authors":["Gunnard Engebreth","Satej Kumar Sahu"],"pages":"star rating fill","publication_date":"December 2022","description":"Take advantage of PHP 8's powerful features to create basic web applications, solve code tests (required for most job interviews nowadays), and begin moving towards more advanced PHP concepts. This book provides an introduction to PHP 8, including modules, attributes, JIT compiler, and union types, as well as related frameworks such as Symfony.\n\nYou will explore fundamental PHP concepts through both practical and hands-on examples. You'll not only gain a solid understanding of PHP fundamentals, but will also be prepared to handle new concepts and technologies as they emerge.\n\nAfter working through the book and its associated demo code, you will be able to build your first basic web application.\n\nWhat You Will Learn\n\nDevelop web applications with PHP 8\nUse Vagrant, Docker, JSON API and more\nWork with data, form data, arrays, objections, exceptions, regex, and more\nUtilize PHP frameworks like Laravel and Symfony\n\nWho This Book Is For\n\nThose new to PHP 8 or PHP in general. Some prior experience in web development and DB handling is recommended.","tags":["Web & Mobile","Web Development","PHP"]},{"id":"9781484283158","language":"en","level":"Beginner","title":"Beginning Eleventy: A Practical Introduction to the Eleventy Static Site Generator","authors":["Alex Libby"],"pages":"350","publication_date":"October 2022","description":"Leverage the power of Eleventy to quickly produce static sites that are efficient and fast. This project-oriented book simplifies the process of setting up Eleventy and manipulating content, using little more than a text editor or free software. \n\nIt will equip you with a starting tool set that you can use to develop future projects or incorporate into your existing workflow. More importantly, you'll take websites to the next level, reducing the reliance on tools that are bloated, prone to being hacked and not the most efficient. Beginning Eleventy is an excellent resource for getting acquainted with creating and manipulating blogs using a static site generator approach. It takes the view that you don’t have to create something complex and unwieldy; you can build something quickly, then extend it using the power of the API and plugins over time, without sacrificing speed or features.\n\nWhat You’ll Learn:\n\nImplement the Eleventy framework in a project\nExplore some of the options for customizing content using the framework\nGain an appreciation of pointers around maintenance requirements, and how this might compare to other blog systems\nWork through some example projects, to help build up a working blog from standalone demos to implementing with other tools or libraries\n\nThis Book Is For?\n\nWebsite developers who are already familiar with JavaScript, who are looking for a fast and simple framework to deliver high quality results fast\nDevelopers who are looking to leverage the Eleventy framework to quickly create an online blog using little more than a text editor, producing optimized content in modern browsers using tools they will already have\nThose in agile development teams, where time is of the essence and need to deliver high quality results quickly","tags":["Web & Mobile","Web Development","Frontend Web Development"]},{"id":"9781492068563","language":"en","level":"Beginner to intermediate","title":"8 Practical Bootstrap Projects","authors":["Maria Antonietta Perna","George Martsoukos","Ashraff Hathibelagal"],"pages":"119","publication_date":"August 2018","description":"Bootstrap stands as one of the most popular, open-source, front-end frameworks on the Web. Since its official release in 2011, it has undergone several changes, and it's now one of the most stable and responsive frameworks available. It's loved by web developers of all levels, as it gives them the capability to build a functional, attractive website design within minutes. A novice developer with just some basic knowledge of HTML and little CSS can easily get started with Bootstrap.\n\nIn this book, we'll share a selection of nine different practical projects that you can follow along with. It contains:\n\nSpicing Up the Bootstrap Carousel with CSS3 Animations by Maria Antonietta Perna\nA Full-screen Bootstrap Carousel with Random Initial Image by George Martsoukos\nAnimating Bootstrap Carousels with GSAP's Animation Library by George Martsoukos\nBuild a Simple Tumblr Theme with Bootstrap by Ashraff Hathibelagal\nHow to Build a Responsive Bootstrap Website by Syed Fazle Rahman\nBootstrap and WordPress Theme Integration in 8 Easy Steps by Ahmed Bouchefra\nIntegrating Bootstrap with React: a Guide for Developers by Manjunath M\nIntegrating Bootstrap with Vue.js using Bootstrap-Vue by Zeeshan Chawdhary\n\nThis book is for all frontend developers who want to build responsive, mobile-first websites. You'll need to be familiar with HTML and CSS and have a reasonable level of understanding of JavaScript in order to follow the discussion.","tags":["Web & Mobile","Web Development","Frontend Web Development","Bootstrap"]},{"id":"9781788996082","language":"en","level":"Beginner","title":"Flutter for Beginners","authors":["Alessandro Biessek"],"pages":"star rating fill","publication_date":"September 2019","description":"\"Flutter for Beginners\" is your gateway into the exciting world of cross-platform mobile app development using Google's Flutter framework and Dart programming language. This book provides a hands-on approach to help you quickly build your skills and start creating functional and visually appealing apps for iOS and Android alike.\n\nWhat this Book will help me do\n\nDevelop a solid understanding of the Dart programming language and its applications.\nLearn and master Flutter UI development to create dynamic mobile app interfaces.\nGain skills to create custom Flutter plugins and enhance functionality.\nDiscover techniques to style apps effectively and incorporate animations for better user engagement.\nLearn to integrate platform-native code to ensure your Flutter apps perform seamlessly.\n\nAuthor(s)\n\nNone Biessek, the author of this book, is an experienced developer and educator in mobile app development. With a hands-on teaching style, None has helped many developers begin their journey into app creation using Dart and Flutter, ensuring even beginners achieve professional results.\n\nWho is it for?\n\nThis book is aimed at developers new to Flutter who have a basic programming background and are eager to learn mobile app development. It's ideal for those who wish to create cross-platform mobile applications without prior Flutter or Dart experience. The book guides readers from fundamentals to advanced features, tailoring to both hobbyists and professionals looking to expand their technical skills.","tags":["Web & Mobile","Mobile Development","Hybrid Mobile Development","Flutter"]},{"id":"9781617291951","language":"en","level":"Beginner","title":"JavaScript Application Design","authors":["Nicolas Bevacqua"],"pages":"star rating fill","publication_date":"January 2015","description":"The fate of most applications is often sealed before a single line of code has been written. How is that possible? Simply, bad design assures bad results. Good design and effective processes are the foundation on which maintainable applications are built, scaled, and improved. For JavaScript developers, this means discovering the tooling, modern libraries, and architectural patterns that enable those improvements.\n\nJavaScript Application Design: A Build First Approach introduces techniques to improve software quality and development workflow. You'll begin by learning how to establish processes designed to optimize the quality of your work. You'll execute tasks whenever your code changes, run tests on every commit, and deploy in an automated fashion. Then you'll focus on designing modular components and composing them together to build robust applications.\n\nAbout the TechnologyAbout the BookWhat's Inside\nAutomated development, testing, and deployment processes\nJavaScript fundamentals and modularity best practices\nModular, maintainable, and well-tested applications\nMaster asynchronous flows, embrace MVC, and design a REST API\nAbout the Reader\n\nThis book assumes readers understand the basics of JavaScript.\n\nAbout the Author\n\nNicolas Bevacqua is a freelance developer with a focus on modular JavaScript, build processes, and sharp design. He maintains a blog at ponyfoo.com.\n\nQuotesEnjoy the ride through the process of improving your development workflow.- From the Foreword by Addy Osmani, GoogleFor JavaScript developers, a must-read!- Stephen Wakely, Thomson ReutersAn excellent guide through the maze of the modern JavaScript ecosystem.- Jonas Bandi, IvoryCode GmbHThe first-ever design book for developers.- Sandeep Kumar Patel, SAP LabsA one-stop shop introducing JavaScript developers to modern practices and tools.- Matthew Merkes, MyNeighbor","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781484224519","language":"en","level":"Beginner to intermediate","title":"Design Patterns in PHP and Laravel","authors":["Kelt Dockins"],"pages":"star rating fill","publication_date":"December 2016","description":"Learn each of the original gang of four design patterns, and how they are relevant to modern PHP and Laravel development. Written by a working developer who uses these patterns every day, you will easily be able to implement each pattern into your workflow and improve your development. Each pattern is covered with full examples of how it can be used.\n\nToo often design patterns are explained using tricky concepts, when in fact they are easy to use and can enrich your everyday development. Design Patterns in PHP and Laravel aims to break down tricky concepts into humorous and easy-to-recall details, so that you can begin using design patterns easily in your everyday work with PHP and Laravel.\n\nThis book teaches you design patterns in PHP and Laravel using real-world examples and plenty of humor.\n\nWhat You Will Learn\n\nUse the original gang of four design patterns in your PHP and Laravel development\n\nHow each pattern should be used\n\nSolve problems when using the patterns\n\nRemember each pattern using mnemonics\n\nWho This Book Is For\n\nPeople using Laravel and PHP to do their job and want to improve their understanding of design patterns.","tags":["Web & Mobile","Web Development","PHP","Laravel"]},{"id":"9781783554874","language":"en","level":"Intermediate to advanced","title":"Learning JavaScript Data Structures and Algorithms","authors":["Loiane Avancini"],"pages":"star rating fill","publication_date":"October 2014","description":"\"Learning JavaScript Data Structures and Algorithms\" is a practical guide designed to help you master the use of data structures and algorithms in JavaScript programming. This book starts with foundational concepts and progressively dives into advanced topics, ensuring a comprehensive understanding of the subject.\n\nWhat this Book will help me do\n\nEffectively use and manipulate arrays, stacks, and queues in JavaScript to handle data.\nDevelop an understanding of complex structures like graphs, along with algorithms like DFS and BFS.\nExplore various linked list structures: singly, doubly, and circular linked lists.\nSort and search data effectively using a variety of algorithms, including bubble sort and binary search.\nUnderstand mathematical concepts such as Big O Notation and their application in programming.\n\nAuthor(s)\n\nLoiane Avancini is an experienced software developer who specializes in JavaScript and front-end programming. With years of experience in the software industry, she has a passion for teaching and writing accessible technical material. Her books are highly regarded for their clear, hands-on style.\n\nWho is it for?\n\nThis book is ideal for JavaScript developers, both newcomers and those with intermediate experience, who want to deepen their knowledge of data structures and algorithms. It's also perfect for learners preparing for coding interviews or those aiming to optimize their code and problem-solving skills. This book provides a strong foundation for both academic and practical applications, making it suitable for students, developers, and enthusiasts alike.","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781484257357","language":"en","level":"Beginner to intermediate","title":"Introducing the HTML5 Web Speech API: Your Practical Introduction to Adding Browser-Based Speech Capabilities to your Websites and Online Applications","authors":["Alex Libby"],"pages":"star rating fill","publication_date":"April 2020","description":"Leverage the power of HTML5 Web Speech API to quickly add voice capabilities to your websites. This project-oriented book simplifies the process of setting up and manipulating the API in the browser using little more than a text editor or free software. \n\nYou'll be presented with a starting toolset that you can use to develop future projects, incorporate into your existing workflow and allow you to take your websites to the next level, reducing the reliance on entering choices through a keyboard and making the overall experience easier for customers.\n\nThis excellent resource is perfect for getting acquainted with creating and manipulating browser-based  APIs. You don’t have to convert your whole work process immediately; you can incorporate as little or as much as you want of the API, and build on this as your skills develop. We live in an age where speed and simplicity are of the essence – this book provides a perfect way to add speech capabilities to our websites, directly in the browser and with the minimum of fuss.\n\nIntroducing the HTML5 Web Speech API is the right choice for developers who want to focus on simplicity to produce properly optimized content in modern browsers using tools already in their possession.\n\nWhat You'll Learn\n\nImplement the Web Speech API in a project\nExplore some of the options for personalizing them for a project\nGain an appreciation of pointers around user experience and how this affects the API\nUnderstand how to manage issues and security when using the API\nWork through some example projects, from standalone demos to implementing with other tools or libraries\n\nWho This Book Is For\n\nWebsite developers who are already familiar with JavaScript, and are keen to learn how to leverage the Web Speech API to quickly add voice-enabled capabilities to a website, using little more than a text editor.It’s ideal for those in agile development teams, where time is of the essence, and the pressure is on to deliver results quickly.","tags":["Web & Mobile","Web Development","Frontend Web Development","HTML"]},{"id":"9781484240694","language":"en","level":"Beginner to intermediate","title":"Practical Application Development with AppRun: Building Reliable, High-Performance Web Apps Using Elm-Inspired Architecture, Event Pub-Sub, and Components","authors":["Yiyi Sun"],"pages":"305","publication_date":"January 2019","description":"Explore the concepts, patterns, and architecture behind AppRun applications. With this end-to-end guide, you will be able to build web apps fast to the market with the low learning curve and high development productivity.\n\nYou will learn how to break down the application logic into three decoupled parts: state, view, and update. You will then see how to connect web page events to the AppRun event life-cycle, route user interactions, access data from the remote servers, compose the user interface using components, and integrate 3rd party libraries.\n\nFollowing examples of various apps, such as the counter app, to-do app, weather app, hacker news reader app, and blog app, you will have all the techniques for developing your AppRun apps including the line of business apps.  You will also review wider development concepts such as using strongly typed states practically, unit testing strategies for app state changes, time travel debugging, async web APIinvocation, server-side virtual DOM, module compilation optimization, the developer tools, and more.\n\nWhat You'll Learn\nUse AppRun to develop web apps end-to-end\nUnderstand the technology behind AppRun\nEvaluate and compare architecture design\nDevelop applications using Elm architecture, event publication and subscription, and components. \nWho This Book Is For \nWeb app developers and architects; useful for beginners learning front-end development and more experienced developers interested in learning about AppRun and modern development concepts and principles more generally","tags":["Web & Mobile","Web Development"]},{"id":"9781783984008","language":"en","level":"Beginner","title":"Getting Started with Knockout.js for .NET Developers","authors":["Andrey Ankshin"],"pages":"188","publication_date":"May 2015","description":"\"Getting Started with Knockout.js for .NET Developers\" is a concise guide for .NET developers looking to master client-side development using the Knockout.js framework. You will learn how to leverage Knockout.js to connect your C# server-side logic to interactive and seamlessly functional client-side JavaScript interfaces, utilizing the powerful MVVM design pattern.\n\nWhat this Book will help me do\n\nUnderstand how to work with observable arrays, computed observables, and special bindings to build dynamic UIs.\nSkillfully integrate Knockout.js into your ASP.NET applications for creating highly interactive client-side user experiences.\nEffectively create a model in C# and connect it with JavaScript using the MVVM structure.\nMaster the process of migrating business logic to the server side while keeping a performant client-side application with Knockout MVC.\nLearn advanced concepts in Knockout.js such as templating, regions, and dependency tracking for an optimized development workflow.\n\nAuthor(s)\n\nAndrey Ankshin is an experienced software developer with a deep knowledge of .NET-based web technologies and frameworks. He specializes in helping developers build robust and scalable web applications using modern client-side frameworks like Knockout.js. Andrey's writing is known for being clear, to-the-point, and infused with practical examples to help readers learn effectively.\n\nWho is it for?\n\nThis book is ideal for .NET developers who have a foundational understanding of ASP.NET and web development concepts, and are looking to enhance their skill set with the powerful Knockout.js library. Suitable candidates will already be skilled in ASP.NET and Razor, and are now eager to transition to building interactive and scalable front-end logic with JavaScript. If you aim to master the MVVM architecture while integrating with server-side logic, this book is for you.","tags":["Web & Mobile","Web Development","JavaScript","Knockout.js"]},{"id":"0642572039622","language":"en","level":"Intermediate","title":"JavaScript Frameworks","authors":["Natalia Venditto"],"publication_date":"June 2024","description":"The video collection is a one-stop-shop for all things JavaScript regardless of if you are a seasoned program manager or a new hire, junior developer. These bite-sized videos cover everything from the basics to advanced techniques: dive into JavaScript's syntax, understand its role in web development, and explore topics like variables, functions, and asynchronous programming. We'll walk through concepts like transpiling and server-side JavaScript, so you can impress your team with your newfound knowledge. Why should you care? Well, JavaScript isn't just another language; it's the backbone of modern web development. For program managers and product owners: are you concerned not to have the knowledge to support or understand your team's requests for a different tool or library? Do you feel lost as soon as the conversation gets more technical? Understanding JavaScript means better communication with your tech team and making smarter decisions when prioritizing tasks, adding libraries and frameworks to the stack and understanding why a tool is needed. And for developers, mastering JavaScript opens doors to building faster, more efficient applications.","tags":["Web & Mobile","Web Development","JavaScript"]},{"id":"9781788475051","language":"en","level":"Beginner to intermediate","title":"Hands-On Android UI Development","authors":["Jason Morris"],"pages":"star rating fill","publication_date":"November 2017","description":"Explore the world of Android UI development with \"Hands-On Android UI Development\". This book guides you through designing and building outstanding user interfaces for Android apps, covering everything from responsive layouts to animations and custom components.\n\nWhat this Book will help me do\n\nDevelop intuitive and efficient user interfaces for Android using best practices.\nMaster responsive designs for various screen sizes and device orientations.\nCustomize the appearance of your apps with styles, themes, and material design guidelines.\nImplement reactive user interfaces with Android architecture components.\nOptimize user experience with animations, transitions, and custom 2D graphics.\n\nAuthor(s)\n\nJason Morris is an experienced Android developer and author passionate about guiding others to create engaging and efficient Android applications. With expertise in Android development tools and UI design patterns, Jason blends hands-on practical insight with a clear teaching style to empower readers.\n\nWho is it for?\n\nThis book is perfect for novice Android developers with basic Java skills looking to enhance their capability in creating stunning user interfaces. It caters to individuals aiming to master UI design principles while leveraging Android's architecture components. If you aim to develop intricate and reactive applications, this book is your ideal guide.","tags":["Web & Mobile","Mobile Development","Native Android Development"]},{"id":"9781849690362","language":"en","level":"Intermediate to advanced","title":"Flash Multiplayer Virtual Worlds","authors":["Makzan Makzan (Mak Seng Hin)"],"pages":"star rating fill","publication_date":"August 2010","description":"Discover how to create captivating online multiplayer experiences with 'Flash Multiplayer Virtual Worlds'. This book equips you with the knowledge to build your own virtual environments where users can interact, engage in quests, and form social communities while leveraging the power of Flash and ActionScript.\n\nWhat this Book will help me do\n\nLearn to design and implement complex virtual worlds with avatars and interactive quests.\nDevelop skills to create multiplayer experiences using ActionScript in Flash IDE.\nMaster the techniques to optimize performance of your virtual worlds including graphics rendering.\nBuild communication interfaces such as basic chat systems and buddy lists for users of your virtual world.\nIncorporate real-world interactivity and social platform integration into your designs.\n\nAuthor(s)\n\nThis book was crafted by seasoned authors with deep expertise in Flash and ActionScript development. Through years of professional experience building interactive games and applications, they bring invaluable insights and a pragmatic approach to mastering multiplayer virtual environments.\n\nWho is it for?\n\nThis book is perfect for Flash and ActionScript developers who are eager to expand their skills into multiplayer game development. Ideal for those with some experience in ActionScript 3.0, it offers both foundational techniques and advanced features to enable readers to create amazing virtual worlds.","tags":["Web & Mobile","Web Development","Adobe Flash"]},{"id":"9781492030331","language":"en","level":"Intermediate to advanced","title":"Measurement tools for high performance","authors":["Maximiliano Firtman"],"pages":"20","publication_date":"December 2017","description":"This excerpt reviews the tools that are available to get real data from your mobile browsers.","tags":["Web & Mobile","Web Development","Web Performance"]},{"id":"9781484241028","language":"en","level":"Beginner","title":"Beginning ARKit for iPhone and iPad: Augmented Reality App Development for iOS","authors":["Wallace Wang"],"pages":"493","publication_date":"November 2018","description":"Explore how to use ARKit to create iOS apps and learn the basics of augmented reality while diving into ARKit specific topics. This book reveals how augmented reality allows you to view the screen on an iOS device, aim the camera at a nearby scene, and view both the real items in that scene as well as a graphic image overlaid on to that scene. \n\nYou’ll start by accessing the camera and teaching your app to track the world around its device. You'll then see how to position nodes and create augmented reality shapes and textures. Next you’ll have your creations interact with their environment by programming workable physics, detecting planes, measuring distance, and applying virtual force. Finally you’ll learn how to hit test and troubleshoot your applications to ensure they interact with the real world around them seamlessly.\n\nARKit is Apple’s software framework for creating augmented reality apps on iOS devices such as the iPhone and iPad. Unlike virtual reality that creates an entirely artificial world for the user to view and explore, Beginning ARKit for iPhone and iPad will show you how augmented reality places artificial items in an actual scene displayed by an iOS device’s camera.  \n\nWhat You’ll Learn\n\nAccess the camera\nUse ARKit’s hit testing for tracked geometry\nApply and combine real world and virtual physics\n\nWho This Book Is For\n\nProgrammers familiar with the basics of Swift programming who want to dive into developing iOS applications with Swift.","tags":["Web & Mobile","Mobile Development","Native iOS Development"]},{"id":"0596527411","language":"en","level":"Intermediate to advanced","title":"CSS Cookbook, 2nd Edition","authors":["Christopher Schmitt"],"pages":"star rating fill","publication_date":"October 2006","description":"As the industry standard method for enriching the presentation of HTML-based web pages, Cascading Style Sheets (CSS) allow you to give web pages more structure and a more sophisticated look. But first, you have to get past CSS theory and resolve real-world problems.\n\nFor those all-too-common dilemmas that crop up with each project, CSS Cookbook provides hundreds of practical examples with CSS code recipes that you can use immediately to format your web pages. Arranged in a quick-lookup format for easy reference, the second edition has been updated to explain the unique behavior of the latest browsers: Microsoft's IE 7 and Mozilla's Firefox 1.5. Also, the book has been expanded to cover the interaction of CSS and images and now includes more recipes for beginning CSS users. The explanation that accompanies each recipe enables you to customize the formatting for your specific needs. With topics that range from basic web typography and page layout to techniques for formatting lists, forms, and tables, this book is a must-have companion, regardless of your experience with Cascading Style Sheets.","tags":["Web & Mobile","Web Development","Frontend Web Development","CSS"]},{"id":"9781491948637","language":"en","level":"Beginner to intermediate","title":"Dreamweaver CC: The Missing Manual, 2nd Edition","authors":["Chris Grover","David Sawyer McFarland"],"pages":"star rating fill","publication_date":"November 2014","description":"Dreamweaver CC is a powerful tool for designing all kinds of websites, from those with simple, static pages to interactive, media-driven sites for desktop, laptop, and mobile devices. But the program still doesn’t include a printed guide to its amazing capabilities. That’s where this Missing Manual comes in. With hands-on tutorials and coverage of every feature, you’ll learn to build, deploy, and manage sites whether you’re an experienced designer or just getting started.\n\nThe important stuff you need to know:\n\nDive into page design. Quickly learn the basics of working with text, images, links, and tables.\nEdit pages in Live view. Dynamically add elements to live pages and immediately see the results.\nDesign once, and for all. Build fluid-grid sites that adapt themselves to desktop, tablet, and mobile devices.\nTroubleshoot your HTML. Use the new Element Quick View to reveal the hierarchy of page elements.\nStyle with ease. Tap Dreamweaver’s enhanced CSS Designer to copy and paste styles.\nEnhance Dreamweaver. Get new program features with add-ons that integrate directly with Dreamweaver.\nBring your pages to life. Use jQuery UI to add interactive page elements like tabbed content panels.\nCreate universal pages. Avoid browser incompatibility with workarounds.","tags":["Web & Mobile","Web Development","DreamWeaver"]},{"id":"9781785885976","language":"en","level":"Intermediate to advanced","title":"Mastering Drupal 8","authors":["Chaz Chumley","William Hurley"],"pages":"456","publication_date":"July 2017","description":"Mastering Drupal 8 is your ultimate guide to navigating the advanced features of Drupal 8, the latest release built on the Symfony2 framework. Through its in-depth chapters, you'll explore robust website development techniques, including theme customization, multilingual content capabilities, and implementing RESTful services.\n\nWhat this Book will help me do\n\nBuild dynamic Drupal 8 websites by mastering advanced site-building techniques.\nDevelop custom Drupal modules using YAML and Symfony2 to enhance functionality.\nImplement multilingual capabilities effortlessly to reach a global audience.\nHarness RESTful services to integrate Drupal with modern frameworks for headless website development.\nStreamline website migrations and configuration management for efficient deployment.\n\nAuthor(s)\n\nSean Montague, Chaz Chumley, and William Hurley are seasoned experts in web development and Drupal technology. Together, they bring decades of experience in creating professional-grade Drupal sites and teaching others via books and workshops. Their combined expertise provides practical and insightful advice tailored for advanced Drupal users.\n\nWho is it for?\n\nThis book is ideal for web developers and administrators with prior experience in Drupal who seek to enhance their skills and create modern, high-performing websites. If you have worked with previous versions of Drupal or have a background in CMS-based systems and want to master Drupal 8's new features, this book is for you.","tags":["Web & Mobile","Web Development","PHP","Drupal"]},{"id":"9780596806705","language":"en","level":"Beginner","title":"Up and Running with Joomla, 2nd Edition","authors":["R. Allen Wyke","Skip Matheny"],"pages":"star rating fill","publication_date":"July 2009","description":"Need to launch a feature-rich website quickly where you have one or more people authoring the content? Want to use a powerful, robust, and scalable Content Management System (CMS) you can trust? This Short Cut will get you up and running with Joomla 1.5, a freely available open source CMS. Learn how to install, configure, customize, and extend your Joomla installation. Also learn the tricks of the trade in how to set up and manage both your content and your users. Joomla can be a challenge to understand at first, so drastically cut your \"get up to speed\" time by taking the Short Cut!","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","Joomla"]},{"id":"9780133821031","language":"en","level":"Intermediate to advanced","title":"Adobe Dreamweaver CC Classroom in a Book - Dreamweaver 13.1 Update (August 2013)","authors":["Adobe CreativeTeam"],"pages":"star rating fill","publication_date":"December 2013","description":"In this update to Adobe Dreamweaver CC: Classroom in a Book, we highlight all the changes to the program in update 13.1, including several enhancements that significantly improve the workflow and tools for building and testing webpages.","tags":["Web & Mobile","Web Development","DreamWeaver"]},{"id":"9780321590961","language":"en","level":"Beginner","title":"Joomla!: Visual QuickStart Guide","authors":["Marni Derr","Tanya Symes"],"pages":"312","publication_date":"November 2008","description":"Joomla! is one of the fastest growing Open Source Content Management Systems on the market today and has won multiple awards since it's release in 2005. Currently, Joomla! has the largest 3rd party developer and designer community, with over 160,000 current registered users, over 2,000 templates, and 3,000 extensions. This task-based guide to creating, customizing, and maintaining a dynamic Joomla! 1.5 web site starts with the fundamental concepts and advantages of a Content Management System and then walks the user through setting up a server environment, downloading and installing Joomla!, adding and structuring content, using components, modules, and plugins, and administrating from both the back and front-ends. The book finishes with more advanced topics, including CSS, search engine optimization (SEO), and customizing templates and the Joomla! framework itself. It's the perfect guide to getting started with Joomla or for those users that want to expand their skills.","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","Joomla"]},{"id":"9780136875314","language":"en","level":"Beginner","title":"Adobe Dreamweaver Classroom in a Book (2021 release)","authors":["James J. Maivald"],"pages":"464","publication_date":"January 2021","description":"The fastest, easiest, most comprehensive way to learn Adobe Dreamweaver\n\nClassroom in a Book®, the best-selling series of hands-on software training workbooks, offers what no other book or training program does -- an official training series from Adobe, developed with the support of Adobe product experts.\n\nAdobe Dreamweaver Classroom in a Book (2021 release) contains lessons that cover the basics and beyond, providing countless tips and techniques to help you become more productive with the program. You can follow the book from start to finish or choose only those lessons that interest you.\n\nPurchase of this book includes valuable online features. Follow the instructions in the books Getting Started section to unlock access to:\n\nDownloadable lesson files you need to work through the projects in the book\n\nWeb Edition containing the complete text of the book, interactive quizzes, and videos that walk you through the lessons step by step\n\nWhat you need to use this book: Adobe Dreamweaver (2021 release) software, for either Windows or macOS. (Software not included.)\n\nNote: Classroom in a Book does not replace the documentation, support, updates, or any other benefits of being a registered owner of Adobe Dreamweaver software.","tags":["Web & Mobile","Web Development","DreamWeaver"]},{"id":"9780470382523","language":"en","level":"Beginner to intermediate","title":"Adobe® Dreamweaver® CS4 Bible","authors":["Joseph Lowery"],"pages":"1321","publication_date":"March 2009","description":"Packed with more than one thousand pages of hands-on instruction and step-by-step tutorials, the bestseller returns with everything you need to know to harness the power of Dreamweaver CS4. This comprehensive resource guides you through the ins and outs of Dreamweaver CS4 so you can quickly get started building dynamic, data-driven sites. The book demonstrates building interactive forms; creating client-side image maps; connecting to a live database; working with layers, style sheets, and dynamic HTML; inserting, deleting, and updating data from Web pages; designing with templates; and integrating with Photoshop, Bridge, Flex, Fireworks, and Cold Fusion, as well as CSS and Ajax.","tags":["Web & Mobile","Web Development","DreamWeaver"]},{"id":"9781484235614","language":"en","level":"Intermediate to advanced","title":"Azure and Xamarin Forms: Cross Platform Mobile Development","authors":["Russell Fustino"],"pages":"star rating fill","publication_date":"June 2018","description":"Discover how to create cross platform apps for Android, iOS and UWP using Azure services and C# with Xamarin Forms. This book illustrates how to utilize Azure cloud storage for serving up Azure SQL DB data through Azure App Services.\n\nThe book starts by setting up Xamarin and introducing Xamarin Forms and then covers the Azure Portal from a developer’s perspective and goes on to demonstrate how to build an Azure Service using Quickstart. You'll also see how to add Azure support to Xamarin Forms application. You'll review in detail how to build a Xamarin Form with Azure Client and modify an existing app to become a Xamarin Forms Client for Azure with offline synchronization.\n\nYou then move on to third-party controls that speed up development. By the end of the book, you will be able to use Azure and Xamarin together and master how to use Azure Mobile Quickstarts, Azure SQL plumbing, database synchronization and Xamarin Forms.\n\nWhat You'll Learn\n\nCreate a Xamarin Forms App and understand the Structure of a Xamarin Forms App. \nNavigate pages and use platform specific coding. \nUse images, ListView and the Azure Mobile App Quickstart to build a Service and  Xamarin Forms app\nModify an existing app to use Azure Client Libraries, understand offline storage with SQLite and incorporate offline synchronization\n\nWho This Book Is For \n\nSoftware developers new to Xamarin and/or Azure and for the developers who are familiar with both the technologies to use in mobile apps.","tags":["Web & Mobile","Mobile Development","Hybrid Mobile Development","Xamarin"]},{"id":"9781849690744","language":"en","level":"Beginner to intermediate","title":"Facebook Graph API Development with Flash","authors":["Michael James Williams"],"pages":"star rating fill","publication_date":"December 2010","description":"Facebook Graph API Development with Flash provides a practical guide for AS3 developers to build interactive and social applications fully integrated with Facebook. Through hands-on projects and clear instructions, you'll discover how to use the Facebook Graph API to securely access and interact with user data, create social experiences, and integrate these features seamlessly into your Flash applications.\n\nWhat this Book will help me do\n\nLearn to build AS3 projects that integrate with Facebook, adding dynamic social features to your applications.\nMaster the basics of the Facebook Graph API, retrieving public and user-specific data effectively.\nSecurely authenticate users using OAuth 2.0, ensuring safe and reliable interactions with Facebook.\nDesign and implement functionalities like uploading photos, posting on walls, and event creation for enriching user experience.\nCreate a reusable AS3 SDK for streamlining Facebook integration into future projects.\n\nAuthor(s)\n\nMichael James Williams is a skilled software developer and author with extensive experience in AS3 and Flash application development. His expertise in creating interactive and engaging applications has shaped his comprehensive teaching methods. Michael crafts his books to be accessible, providing practical, step-by-step instructions that empower readers to build robust applications.\n\nWho is it for?\n\nThis book is ideal for AS3 developers looking to enhance their projects with Facebook integration, whether for interactive applications or games. It's beginner-friendly, even if you are new to Facebook's APIs, databases, or server-side programming. If your goal is to create social applications with a touch of personalization, this book is a perfect fit. Explore the potential of your Flash projects by connecting them with Facebook's social graph.","tags":["Web & Mobile","Web Development","Apache Flex"]},{"id":"9781449315016","language":"en","level":"Beginner","title":"What Is Node?","authors":["Brett McLaughlin"],"pages":"star rating fill","publication_date":"July 2011","description":"Node.js. It’s the latest in a long line of “Are you cool enough to use me?” programming languages, APIs, and toolkits. In that sense, it lands squarely in the tradition of Rails, and Ajax, and Hadoop, and even to some degree iPhone programming and HTML5.Dig a little deeper, and you’ll hear that Node.js (or, as it’s more briefly called by many, simply “Node”) is a server-side solution for JavaScript, and in particular, for receiving and responding to HTTP requests. If that doesn’t completely boggle your mind, by the time the conversation heats up with discussion of ports, sockets, and threads, you’ll tend to glaze over. Is this really JavaScript? In fact, why in the world would anyone want to run JavaScript outside of a browser, let alone the server?The good news is that you’re hearing (and thinking) about the right things. Node really is concerned with network programming and server-side request/response processing. The bad news is that like Rails, Ajax, and Hadoop before it, there’s precious little clear information available. There will be, in time — as there now is for these other “cool” frameworks that have matured — but why wait for a book or tutorial when you might be able to use Node today, and dramatically improve the maintainability.","tags":["Web & Mobile","Web Development","Node.js"]},{"id":"9781847193599","language":"en","level":"Beginner to intermediate","title":"WordPress Plugin Development: Beginner's Guide","authors":["Vladimir Prelovac"],"pages":"star rating fill","publication_date":"February 2009","description":"WordPress Plugin Development: Beginner's Guide is your ultimate resource for learning to create custom plugins for WordPress, designed to extend and tailor its functionality. Through practical tutorials and real-world examples, you'll master essential plugin development skills, enabling you to create dynamic plugins and understand how WordPress works under the hood.\n\nWhat this Book will help me do\n\nUnderstand and utilize the WordPress plugin architecture and API for custom development.\nBuild and customize WordPress plugins to enhance site functionality with practical examples.\nIncorporate dynamic interactivity into plugins using AJAX and jQuery.\nMaintain the security of your WordPress plugins and publish them to WordPress Plugin Repository.\nLearn to use the WordPress database and manipulate content dynamically in plugins.\n\nAuthor(s)\n\nThe author, Vladimir Prelovac, is a renowned WordPress developer and author who has contributed extensively to the WordPress community. His expertise includes creating widely-used plugins such as Smart YouTube and Plugin Central. Drawing on real-world experience, his writing offers deep insights into plugin development.\n\nWho is it for?\n\nThis book is ideal for programmers with a basic understanding of PHP and WordPress who wish to build custom plugins. Whether you're enhancing existing functionality or creating innovative additions, this book supports your growth. If you're a WordPress enthusiast ready to elevate your site-building skills, this book is for you.","tags":["Web & Mobile","Web Development","Content Management","Content Management Systems","WordPress"]},{"id":"073849027X","language":"en","level":"Intermediate to advanced","title":"Student Edition: WebSphere Development Studio Client for iSeries V5.0","authors":["Aleksandr V. Nartovich","Wilfried Blankertz","John Dell'Oso"],"pages":"654","publication_date":"July 2004","description":"IBM has created several host access products. One of the newest additions to this family of products is the IBM WebFacing Tool. The IBM WebFacing Tool is packaged as part of WebSphere Development Studio Client for iSeries (Development Studio Client). It converts existing data description specifications (DDS) into Java artifacts that are deployed in an application server, such as, WebSphere Application Server. The advantage of using the IBM WebFacing Tool is that existing IBM eServer iSeries applications require no or few modifications. These applications are accessible from both the Web and iSeries display devices.\n\nThis IBM Redbooks publication discusses WebSphere Development Studio Client for iSeries V5.0 and the IBM WebFacing Tool. Development Studio Client includes several powerful tools that target iSeries application developers:\n\nWebSphere Studio Site Developer Advanced or WebSphere Studio Application Developer\n\niSeries-specific features such as the WebFacing Tool\n\nCoOperative Development Environment (CODE)\n\nVisualAge RPG\n\nIntegrated iSeries debugger\n\nNote: This book targets university and college students who are studying computer and information technology. It is based on the original edition of \" WebSphere Development Studio Client for iSeries V5.0\", SG24-6961, published August 2003. While the content in this Student Edition is essentially the same as the original book, IBM Business Partners, Customers, and other technical professionals should refer to the original edition SG24-6961.\n\nPlease note that the additional material referenced in the text is not available from IBM.","tags":["Web & Mobile","Web Development","Web & Application Servers","WebSphere"]},{"id":"9781783287451","language":"en","level":"Intermediate to advanced","title":"Learning Highcharts 4 - Second Edition","authors":["Joe Kuan"],"pages":"star rating fill","publication_date":"January 2015","description":"Learning Highcharts 4 guides you step-by-step in designing, implementing, and customizing interactive charts for web applications with Highcharts. You'll discover how to work with various chart types and high-level customization, making your data visually impressive and accessible.\n\nWhat this Book will help me do\n\nGain proficiency in setting up and configuring Highcharts for JavaScript charting.\nMaster the creation of advanced chart types like bubble, heatmap, and 3D charts.\nUnderstand Highcharts API for dynamic interactivity and custom functionality.\nExplore Highcharts integration with frameworks like jQuery Mobile and ExtJS.\nLearn to implement server-side Highcharts solutions and utilize plugins effectively.\n\nAuthor(s)\n\nJoe Kuan is a seasoned developer and data visualization expert with a deep understanding of Highcharts and web application development. His practical insights and step-by-step tutorials reflect his commitment to teaching complex technologies in a simple, approachable way.\n\nWho is it for?\n\nThis book is perfect for web developers and data visualization professionals looking to enhance their internet applications with charts. Beginners will appreciate the step-by-step tutorials on Highcharts basics, while experienced developers will find in-depth coverage of APIs and server-side implementation. If you're looking to make your data more visually engaging and impactful, this resource is for you.","tags":["Web & Mobile","Web Development","Frontend Web Development","SVG"]},{"id":"9780321699565","language":"en","level":"Beginner","title":"Learning iOS Game Programming","authors":["Michael Daley"],"pages":"star rating fill","publication_date":"September 2010","description":"Get Started Fast with iOS Game Programming\n\nSince the launch of the App Store, games have been the hottest category of apps for the iPhone, iPod touch, and iPad. That means your best chance of tapping into the iPhone/iPad “Gold Rush” is to put out a killer game that everyone wants to play (and talk about). While many people think games are hard to build, they can actually be quite easy, and Learning iOS Game Programming is your perfect beginner’s guide. Michael Daley walks you through every step as you build a killer 2D game for the iPhone.\n\nIn Learning iOS Game Programming, you’ll learn how to build a 2D tile map game, Sir Lamorak’s Quest: The Spell of Release (which is free in the App Store). You can download and play the game you’re going to build while you learn about the code and everything behind the scenes. Daley identifies the key characteristics of a successful iPhone game and introduces the technologies, terminology, and tools you will use. Then, he carefully guides you through the whole development process: from planning storylines and game play all the way through testing and tuning.\n\nDownload the free version of Sir Lamorak’s Quest from the App Store today, while you learn how to build the game in this book.\n\n  \n\nCoverage includes \n\nPlanning high-level game design, components, and difficulty levels\n\nUsing game loops to make sure the right events happen at the right time\n\nRendering images, creating sprite sheets, and building basic animations\n\nUsing tile maps to build large game worlds from small reusable images\n\nCreating fire, explosions, smoke, sparks, and other organic effects\n\nDelivering great sound via OpenAL and the iPhone’s media player\n\nProviding game control via iPhone’s touch and accelerometer features\n\nCrafting an effective, intuitive game interface\n\nBuilding game objects and entities and making them work properly\n\nDetecting collisions and ensuring the right response to them\n\nPolishing, testing, debugging, and performance-tuning your game \n\nLearning iOS Game Programming focuses on the features, concepts, and techniques you’ll use most often—and helps you master them in a real-world context. This book is 100% useful and 100% practical; there’s never been an iPhone game development book like it!\n\nPraise for Learning iOS Game Programming\n\n“An excellent introduction into the world of game development explaining every aspect of game design and implementation for the iPad, iPhone, and iPod touch devices. A great way for anyone interested in writing games to get started.”\n\n–Tom Bradley, Software Architect, Designer of TBXML\n\n“A great developer and a great game.That’s everything you can find in this book to learn how to write an awesome game for iPhone.Maybe you’re the next AppStore hit!”\n\n–Sebastien Cardoso\n\n“With Learning iOS Game Programming, you’ll be writing your own games in no time. The code included is well explained and will save you hours of looking up obscure stuff in the documentation and online forums.”\n\n–Pablo Gomez Basanta, Founder, Shifting Mind\n\n“I always thought that to teach others one has to be an expert and a person with an established reputation in the field. Michael Daley proved me wrong. He is teaching others while studying himself. Michael’s passion in teaching and studying, ease of solutions to problems, and a complete game as a resulting project makes this book one of the best I have ever read.”\n\n–Eugene Snyetilov\n\n“If you’re interested in 2D game programming with the iOS using OpenGL and OpenAL directly, this book walks you through creating a complete and fun game without getting bogged down in technical details.”\n\n–Scott D.Yelich\n\n“Michael Daley brings clarity to the haze of iPhone application development. Concrete examples, thorough explanation, and timesaving tips make this book a must have for the up and coming iPhone game developer.”\n\n–Brandon Middleton, Creator of Tic Tac Toe Ten\n\n“This is the A-Z guide to iOS game development; Michael’s book takes you from the basics and terminology to using the techniques in practice on a fully working game. Before you know it, you will find yourself writing your own game, fueled by a firm grasp of the principles and techniques learned within. I could not ask for a better reference in developing our own games.”\n\n–Rod Strougo, Founder Prop Group","tags":["Web & Mobile","Mobile Development","Native iOS Development"]},{"id":"9781786464507","language":"en","level":"Beginner","title":"iOS 10 Programming for Beginners","authors":["Craig Clayton"],"pages":"star rating fill","publication_date":"December 2016","description":"This book, \"iOS 10 Programming for Beginners,\" serves as your guided entry into iOS development. Learn to use Swift 3 and Xcode, the essential tools for building apps for iPhone and iPad. By following practical, actionable lessons, you will design, build, and publish iOS apps, gaining valuable skills every step of the way.\n\nWhat this Book will help me do\n\nUnderstand the fundamentals of Swift 3 programming and how it integrates with iOS.\nLearn the essentials of using Xcode for iOS app development, from installation to advanced use.\nDesign user interfaces that follow iOS design standards and work on both iPhone and iPad.\nImplement advanced features such as data persistence, location services, and notifications.\nNavigate the App Store submission process and publish your app effectively.\n\nAuthor(s)\n\nCraig Clayton is a seasoned iOS developer and educator with extensive experience in leveraging Swift and iOS technologies to create user-friendly apps. With a passion for teaching, Craig has written and taught courses aimed at enabling developers to understand complex concepts with ease. His approach combines practical examples and thorough exploration of Apple's development toolkit.\n\nWho is it for?\n\nThis book is aimed at beginners aspiring to develop their skills as iOS developers. It is ideal for those who are new to programming but are excited to build professional-grade apps. Even experienced programmers will find the clear, structured guidance helpful in mastering the nuances of Swift 3 and iOS 10. Anyone looking to successfully publish apps and understand the development process comprehensively will greatly benefit from this book.","tags":["Web & Mobile","Mobile Development","Native iOS Development"]},{"id":"9781789340310","language":"en","level":"Beginner","title":"Drupal 8 Quick Start Guide","authors":["J. Ayen Green"],"pages":"128","publication_date":"October 2018","description":"Drupal 8 Quick Start Guide is an essential resource for anyone looking to effectively learn and use Drupal 8. With clear guidance from installation to creating a fully customized site, this book simplifies Drupal's complexity step-by-step. You will gain hands-on experience with setting up content structures, user roles, and enhancements using popular modules.\n\nWhat this Book will help me do\n\nEfficiently set up and manage Drupal 8 installations.\nCreate and manage structured content and utilize categorization effectively.\nConfigure user roles, permissions, and secure access protocols.\nEnhance site functionality through add-on modules and extensions.\nOptimize your website for a global audience with translations and custom feeds.\n\nAuthor(s)\n\nJ. Ayen Green is an experienced developer and educator with deep expertise in content management systems and web development. Having worked with Drupal for many years, they bring valuable insights and practical knowledge to users. Their writing aims to make complex topics accessible, and their approachable style simplifies even the trickiest concepts.\n\nWho is it for?\n\nThis guide is perfect for content administrators, developers, and site builders who are new to Drupal 8 but eager to master it. Whether you're a beginner or have some experience, this book's clear explanations and examples will help you build proficiency. You'll gain the skills needed to install, configure, and customize a Drupal site tailored to your needs.","tags":["Web & Mobile","Web Development","PHP","Drupal"]},{"id":"9781430237105","language":"en","level":"Beginner","title":"Beginning iOS 5 Games Development: Using the iOS 5 SDK for iPad, iPhone, and iPod Touch","authors":["Lucas Jordan"],"pages":"star rating fill","publication_date":"November 2011","description":"Game apps on iPhone and now iPad remain one of the most popular type of apps in the Apple iTunes App Store. Does Angry Birds ring a bell? What you were once able to do just for the iPhone (and iPod touch) is now possible for the popular iPad, using the new iOS 5 SDK.\n\nBeginning iOS 5 Games Development provides a clear path for you to create games using the iOS 5 SDK platform for the iPad, iPhone, and iPad touch. You'll learn how to use the core classes to create game apps, including graphics, animations, and sound. The latest version of Xcode will be used in parts of the book to guide you along the way of building your apps.\n\nOther topics include iOS 5 game apps development with the newest iOS Game Center update, persisting user data, and designing a compelling user experience. After reading this book, you'll come away with the skills and techniques for building a game app, top to bottom, that could perhaps even be sold on the Apple iTunes App Store.","tags":["Web & Mobile","Mobile Development","Native iOS Development"]},{"id":"0596510225","language":"en","level":"Intermediate to advanced","title":"Google Web Toolkit for Ajax","authors":["Bruce W. Perry"],"pages":"40","publication_date":"January 2007","description":"The Google Web Toolkit (GWT) is a nifty framework that Java programmers can use to create Ajax applications. The GWT allows you to create an Ajax application in your favorite IDE, such as IntelliJ IDEA or Eclipse, using paradigms and mechanisms similar to programming a Java Swing application. After you code the application in Java, the GWT's tools generate the JavaScript code the application needs.\n\nYou can also use typical Java project tools such as JUnit and Ant when creating GWT applications. The GWT is a free download, and you can freely distribute the client- and server-side code you create with the framework. This shortcut explains how to get started with the GWT, and then demonstrates how to create a simple Ajax application.","tags":["Web & Mobile","Web Development","Google Web Toolkit"]},{"id":"0738423114","language":"en","level":"Intermediate to advanced","title":"A Comprehensive Guide to IBM WebSphere Host Publisher Version 3.5","authors":["Juan R. Rodriguez","Vikram Belapurkar","Renata Carvalho"],"pages":"730","publication_date":"September 2001","description":"This IBM Redbooks publication helps you to understand the functions provided by the IBM WebSphere Host Publisher Version 3.5 release. It focuses on the architectures and technologies implemented in this release, and helps you plan, install, configure and deploy your Host Access applications (3270, 5250) quickly in a wide variety of environments. In this book, you will find information on the installation, configuration and customization of these applications using the IBM WebSphere Host Publisher Version 3.5 Studio to create Integration Objects that can be accessed from JavaServer Pages (JSPs), Java applets, Java servlets, Java stand-alone applications, Enterprise Java Bean (EJB) applications, XML applications and desktop Web browsers.\n\nYou will also find numerous configuration examples and scenarios showing ways to set up the IBM WebSphere Host Publisher Version 3.5 server to access host applications from EJBs. In addition, this book provides a good description of the new Express Logon authentication feature and Remote Integration Object (RIO) support that allows you to access Integration Objects from client devices such as Web browsers, Java and XML applications. A basic knowledge of Java technologies such as servlets, JavaBeans, EJBs, JavaServer Pages (JSPs), as well as XML applications and the terminology used in Web publishing, is assumed.","tags":["Web & Mobile","Web Development","Web & Application Servers","WebSphere"]},{"id":"0321374126","language":"en","level":"Beginner to intermediate","title":"Ten Ton Dreamweaver","authors":["Geoff Blake"],"pages":"456","publication_date":"February 2006","description":"If you're thinking about creating or maintaining Web sites, you're likely to turn to Dreamweaver, the de facto software tool of choice for Web design today. What could be a chore, however, becomes a fun and fascinating challenge with this comprehensive yet clever guide. Author Geoff Blake turns a technical topic into an entertaining one by using conversational language, plenty of humor, facts, and tips to make Dreamweaver accessible to everyone. Behind all the jokes, however, is a wealth of information: After showing how Dreamweaver fits into the overall Web design puzzle, Geoff quickly gets down to building a basic Web site, by teaching good, 21st century work habits and providing step-by-step instructions for building pages from the very beginning with CSS styles and library items. With that knowledge under your belt, you’ll be ready to tackle the advanced functionality (including behaviors, multimedia, and templates).","tags":["Web & Mobile","Web Development","DreamWeaver"]},{"id":"9781430246879","language":"en","level":"Beginner","title":"Beginning Android, Fifth Edition","authors":["Grant Allen"],"pages":"440","publication_date":"April 2015","description":"Get started in creating marketable apps for the burgeoning Android market. Begin your journey by learning the essentials of programming for phones and tables that are built around Google's wildly-successful Android platform. Beginning Android, Fifth Edition is fresh with details on the latest iteration of the Android 5 and earlier versions.\n\nGoogle’s Android operating-system has taken the industry by storm, going from its humble beginnings as a smartphone operating system to its current status as a platform for apps that run across a gamut of devices from phones to tablets to netbooks to televisions, and the list is sure to grow. Smart developers are not sitting idly by in the stands, but are jumping into the game of creating innovative and salable applications for this fast-growing, mobile- and consumer-device platform. If you’re not in the game yet, now is your chance!\n\nBegin at the beginning by installing the tools and compiling a skeleton app. Move through creating layouts, employing widgets, taking user input, and giving back results. Soon you’ll be creating innovative applications involving multi-touch, multi-tasking, and more! You’ll be drawing data live from the Internet using web services and delighting your customers with life-enhancing apps. Not since the PC era first began has there been this much opportunity for the common developer. What are you waiting for? Grab your copy of Beginning Android and get started!","tags":["Web & Mobile","Mobile Development","Native Android Development"]},{"id":"9780596514020","language":"en","level":"Intermediate to advanced","title":"Implementing BEA Portal 92","authors":["Mark Kolb"],"pages":"79","publication_date":"July 2007","description":"Portals have come into their own in the last several years. Over this time, I have seen portal technology become the latest expression of businesses trying to organize the torrent of information that computers bring.\n\nBEA portal is a leader in portal technology. It allows for an enterprise level of support, stability, and capability. Portal 92 has the tools to make your next portal project a success. It also has the sophistication to keep your portal running and remaining relevant to your business. If you are investigating BEA Portal technology, or if you are a seasoned BEA administrator, you will benefit from this document. In this Short Cut, I will discuss implementing the latest version of BEA Portal in a no-nonsense, straight forward fashion. Interested? Read on.","tags":["Web & Mobile","Web Development","Portlets"]},{"id":"0738490857","language":"en","level":"Intermediate to advanced","title":"WebSphere Business Integration Server Foundation V5.1 Handbook","authors":["Peter Kovari","Lisa Boardman","Giles Dring"],"pages":"614","publication_date":"November 2004","description":"This IBM Redbooks publication describes the technical details of WebSphere Business Integration Server Foundation and discusses using WebSphere Studio Application Developer Integration Edition for application development. It provides valuable information for system administrators, developers and architects about the products covered. This book specifically focuses on WebSphere Process Choreographer and on solutions implementing it.\n\nPart 1, “Architecting a WebSphere Enterprise solution” includes high-level details about WebSphere solutions using WebSphere Business Integration Server Foundation.\n\nPart 2, “Setting up the environment” provides step-by-step details about installing the runtime and development environments.\n\nPart 3, “Implementing WebSphere Enterprise solutions” provides details about the J2EE Programming Model Extensions and functions in WebSphere Business Integration Server Foundation. You can learn how to design, develop, assemble, deploy and administer applications in the WebSphere Business Integration Server Foundation environment.\n\nPlease note that the additional material referenced in the text is not available from IBM.","tags":["Web & Mobile","Web Development","Web & Application Servers","WebSphere"]},{"id":"9780672329685","language":"en","level":"Beginner","title":"Creating Vista Gadgets: Using HTML, CSS and JavaScript with Examples in RSS, Ajax, ActiveX (COM) and Silverlight","authors":["Rajesh Lal"],"pages":"360","publication_date":"May 2008","description":"A one-stop resource for each aspect of designing and developing Sidebar gadgets, perfect for anyone who wants to create killer gadgets\n\nExplores one of the super cool features new to Windows Vista -- the Sidebar\n\nIt is a one-stop resource for each aspect of designing and developing Sidebar gadgets, perfect for anyone who wants to create killer gadgets\n\nIncludes complete design instructions for four never-before-seen gadgets\n\nWindows Vista Sidebar is a panel located on the desktop of a PC where gadgets can be placed for easy access and reference. These gadgets are small, single-purpose applications, such as clocks, calendars, games, RSS notifiers, search tools, stock tickers, etc, that reside on the Windows desktop and on the Windows Sidebar. The book will be a tutorial to design and develop a gadget. It will provide ready-to-use samples using .NET, XML, CSS and AJAX. After reading the book, a web developer/designer will be confident enough to start developing gadgets for Windows Vista Sidebar. The beginner portion of the book shows an overview of the subject with the design pattern, the architecture and implementation details. The later sections will have solid examples for instant results. In short, the book will tell how to do everything with Sidebar Gadgets using solid, unique examples. Brief outline: \" Brief background on Gadgets \" Define architecture, design consideration and implementation to give a clear view to the developer \" Step by step, create a useful Gadget sample \"My Blogs\" \" Elaborate the architecture design constraint and implementation details for the sample \" Detail the standard practices \" Recheck the gadget created for standard practices \" Improvise and Improve with compare and contrast \" Add advanced samples with .NET, AJAX and XHTML.","tags":["Web & Mobile","Web Development","Frontend Web Development","CSS"]}]